[
  {"g":"ハードウェア","q":"CPUの主な役割は、命令を解釈して実行することである。","a":"A","e":"命令の解釈・実行、演算と制御がCPUの基本的な役割です。"},
  {"g":"ハードウェア","q":"主記憶装置は、CPUが直接アクセスできないため補助記憶装置と呼ばれる。","a":"B","e":"主記憶装置にはCPUが直接アクセスします。補助記憶はHDDやSSDなどです。"},
  {"g":"ハードウェア","q":"キャッシュメモリは、CPUと主記憶装置の速度差を埋めるために用いられる。","a":"A","e":"よく使うデータや命令をキャッシュに置き、アクセスを高速化します。"},
  {"g":"ハードウェア","q":"SRAMはDRAMよりも高速だが、高価で容量は小さい傾向にある。","a":"A","e":"SRAMはレジスタやキャッシュに、DRAMは主記憶に使われます。"},
  {"g":"ハードウェア","q":"フラッシュメモリは、不揮発性メモリであり、電源を切っても内容が保持される。","a":"A","e":"USBメモリやSSDなどに利用される半導体記憶です。"},
  {"g":"ハードウェア","q":"RAID1はデータのストライピングにより高速化を図る方式である。","a":"B","e":"RAID1はミラーリング方式で耐障害性重視、ストライピングはRAID0です。"},
  {"g":"ハードウェア","q":"RAID0は1台のディスクが故障しても、システム全体は止まらない。","a":"B","e":"RAID0は耐障害性がなく、1台でも故障するとデータを失います。"},
  {"g":"ハードウェア","q":"クロック周波数が高いほど、一般にCPUの処理速度は向上する。","a":"A","e":"同一世代のCPUであれば、クロック周波数は性能指標の1つになります。"},
  {"g":"ハードウェア","q":"GPUは、画像処理に特化したプロセッサであり、並列計算にも利用される。","a":"A","e":"ディープラーニングなどのGPGPU用途でも使われています。"},
  {"g":"ハードウェア","q":"補助記憶装置は、主に揮発性メモリで構成される。","a":"B","e":"補助記憶はHDDやSSDなどの不揮発性記憶装置が使われます。"},
  {"g":"ハードウェア","q":"USBメモリは磁気ディスク装置の一種である。","a":"B","e":"USBメモリは半導体メモリを用いたフラッシュメモリ装置です。"},
  {"g":"ハードウェア","q":"スキャナは、アナログの文書や画像をディジタルデータに変換する入力装置である。","a":"A","e":"紙の資料を画像データとして取り込む装置です。"},

  {"g":"OS・プロセス","q":"スレッドは、プロセス内で実行される最小の処理単位である。","a":"A","e":"同一プロセス内でメモリ空間を共有して動作します。"},
  {"g":"OS・プロセス","q":"プロセスは必ず1つ以上のスレッドを持つ。","a":"A","e":"単一スレッドプロセスであっても、少なくとも1本のスレッドが動作します。"},
  {"g":"OS・プロセス","q":"スラッシングとは、ページングがほとんど行われない状態を指す。","a":"B","e":"スラッシングはページングが過剰に発生し、処理が進まなくなる状態です。"},
  {"g":"OS・プロセス","q":"仮想記憶方式では、主記憶よりも大きな番地空間をプログラムに提供できる。","a":"A","e":"補助記憶を主記憶の延長として利用することで大きな仮想アドレス空間を実現します。"},
  {"g":"OS・プロセス","q":"ラウンドロビン方式は、優先度の高いプロセスだけを連続的に実行する方式である。","a":"B","e":"ラウンドロビンはタイムクウォンタムごとにプロセスを順番に切り替える方式です。"},
  {"g":"OS・プロセス","q":"デッドロックは、一時的な待ち状態であり、必ず自動的に解消される。","a":"B","e":"デッドロックは互いに資源を待ち合うため自力では解消されないことがあります。"},
  {"g":"OS・プロセス","q":"デッドロックの必要条件の一つに、相互排他がある。","a":"A","e":"相互排他・保持と待ち・非奪取・循環待ちの4条件が必要条件です。"},
  {"g":"OS・プロセス","q":"スプーリングは、低速な入出力装置とCPUとの速度差を吸収する仕組みである。","a":"A","e":"一時的に補助記憶にデータを蓄え、入出力を効率化します。"},
  {"g":"OS・プロセス","q":"プリエンプションとは、実行中のプロセスを強制的に中断してCPUを他プロセスに割り当てることである。","a":"A","e":"タイムシェアリングOSなどで用いられる仕組みです。"},
  {"g":"OS・プロセス","q":"カーネルは、OSの中で利用者アプリケーションに最も近い部分である。","a":"B","e":"カーネルはハードウェアに近い中核部分であり、ユーザアプリはその外側で動作します。"},
  {"g":"OS・プロセス","q":"ページフォールトは、参照しようとしたページが主記憶に存在しないときに発生する。","a":"A","e":"ディスクから該当ページを読み込む必要が生じます。"},
  {"g":"OS・プロセス","q":"マルチタスクとは、複数のコンピュータを同時に動作させる仕組みである。","a":"B","e":"マルチタスクは1台のコンピュータで複数のタスクを同時進行的に扱うことです。"},

  {"g":"ネットワーク","q":"OSI基本参照モデルの第3層はネットワーク層である。","a":"A","e":"第1層:物理、第2層:データリンク、第3層:ネットワーク層です。"},
  {"g":"ネットワーク","q":"TCPはコネクションレス型プロトコルであり、信頼性は低い。","a":"B","e":"TCPはコネクション型で信頼性の高いプロトコルです。"},
  {"g":"ネットワーク","q":"UDPは、再送制御や順序制御を行わないため高速である。","a":"A","e":"信頼性の代わりに軽量さと高速性を重視したプロトコルです。"},
  {"g":"ネットワーク","q":"IPアドレスとサブネットマスクのANDをとることで、ネットワークアドレスが求められる。","a":"A","e":"ネットワーク部だけが残り、同一ネットワークかどうかの判定に使います。"},
  {"g":"ネットワーク","q":"DNSは、IPアドレスからMACアドレスへの変換を行う仕組みである。","a":"B","e":"DNSはドメイン名とIPアドレスの対応を管理します。MACアドレスとの対応はARPです。"},
  {"g":"ネットワーク","q":"HTTPは、Webページの送受信に用いられるアプリケーション層のプロトコルである。","a":"A","e":"ブラウザとWebサーバ間の通信で使われます。"},
  {"g":"ネットワーク","q":"MACアドレスは、ネットワークインタフェースごとに割り当てられる物理アドレスである。","a":"A","e":"LANカードや無線LANインタフェースに固有のアドレスです。"},
  {"g":"ネットワーク","q":"ルータは、物理層で動作し、ビット列のON/OFFを中継する装置である。","a":"B","e":"ルータはネットワーク層で動作し、IPアドレスに基づいてパケットを転送します。"},
  {"g":"ネットワーク","q":"スイッチングハブは、通常データリンク層で動作し、MACアドレスに基づきフレームを転送する。","a":"A","e":"宛先MACアドレスによって転送先ポートを決定します。"},
  {"g":"ネットワーク","q":"NATは、プライベートIPアドレスとグローバルIPアドレスとの変換を行う技術である。","a":"A","e":"家庭用ルータなどでよく使われるアドレス変換技術です。"},
  {"g":"ネットワーク","q":"IPv6のアドレス長は、32ビットである。","a":"B","e":"IPv6は128ビット長、IPv4は32ビット長です。"},
  {"g":"ネットワーク","q":"VPNは、インターネット上に暗号化された仮想的な専用線を構築する技術である。","a":"A","e":"離れた拠点間を安全に接続するために用いられます。"},

  {"g":"データベース","q":"第1正規形では、表の各セルは単一の値を持たなければならない。","a":"A","e":"繰り返し項目や複数値を1セルに入れないことが条件です。"},
  {"g":"データベース","q":"主キーは、レコードを一意に識別できる項目または項目の組合せである。","a":"A","e":"同じ主キー値を持つレコードは存在してはいけません。"},
  {"g":"データベース","q":"外部キーは、別の表の主キーを参照する項目であり、表間の関連を表す。","a":"A","e":"参照整合性を保つ役割があります。"},
  {"g":"データベース","q":"正規化の目的は、データの重複を減らし、更新時の不整合を防ぐことである。","a":"A","e":"効率的で整合性の高いデータ構造を得るために正規化を行います。"},
  {"g":"データベース","q":"SQLのSELECT文は、データの削除を行うために用いられる。","a":"B","e":"削除はDELETE文、検索はSELECT文です。"},
  {"g":"データベース","q":"トランザクションは、分割不可能な一連の処理単位として扱われる。","a":"A","e":"途中でエラーが起きた場合は全体を取り消すことができます。"},
  {"g":"データベース","q":"トランザクションのACID特性のうち、Iは可用性(Availability)を表す。","a":"B","e":"ACIDは原子性Atomicity、一貫性Consistency、独立性Isolation、永続性Durabilityです。"},
  {"g":"データベース","q":"ビューは、複数の表を結合した結果を仮想的な表として扱う機能である。","a":"A","e":"複雑な問い合わせを簡略化したり、アクセス制御に利用できます。"},
  {"g":"データベース","q":"インデックスを付与すると、検索性能が向上する場合がある。","a":"A","e":"索引を用いて必要なレコードを素早く見つけることができます。"},
  {"g":"データベース","q":"排他制御は、同時実行性を高めるために、あえてロックを行わない仕組みである。","a":"B","e":"排他制御は、同時更新による不整合を防ぐためにロックを用いる仕組みです。"},
  {"g":"データベース","q":"ER図のひし形はエンティティを表し、長方形はリレーションシップを表す。","a":"B","e":"一般的に長方形がエンティティ、ひし形がリレーションシップです。"},
  {"g":"データベース","q":"SQLのWHERE句は、検索条件を指定するために用いられる。","a":"A","e":"SELECT文やUPDATE文などで条件指定に使用します。"},

  {"g":"セキュリティ","q":"情報セキュリティの3要素CIAとは、機密性・完全性・可用性を指す。","a":"A","e":"Confidentiality, Integrity, Availabilityの頭文字です。"},
  {"g":"セキュリティ","q":"共通鍵暗号方式では、暗号化と復号に異なる鍵を使用する。","a":"B","e":"同じ鍵を使うのが共通鍵暗号方式、異なる鍵を使うのが公開鍵暗号方式です。"},
  {"g":"セキュリティ","q":"公開鍵暗号方式は、鍵の配布が容易だが、共通鍵暗号方式よりも一般に処理が遅い。","a":"A","e":"ハイブリッド方式として両者を組み合わせて利用することが多いです。"},
  {"g":"セキュリティ","q":"ディジタル署名は、送信者の認証や改ざんの検出に利用される。","a":"A","e":"否認防止の目的にも用いられます。"},
  {"g":"セキュリティ","q":"バッファオーバーフローは、メモリ領域の境界を超えてデータを書き込んでしまうことで発生する漏洞である。","a":"A","e":"悪用されると任意のコード実行などにつながります。"},
  {"g":"セキュリティ","q":"マルウェアには、ウイルス・ワーム・トロイの木馬などの種類がある。","a":"A","e":"ランサムウェアやスパイウェアなどもマルウェアの一種です。"},
  {"g":"セキュリティ","q":"ファイアウォールは、内部ネットワークを外部からの不正アクセスや攻撃から守る仕組みである。","a":"A","e":"パケットフィルタリングやアプリケーションゲートウェイなどの方式があります。"},
  {"g":"セキュリティ","q":"SQLインジェクションは、OSコマンドを不正に実行させる攻撃である。","a":"B","e":"SQLインジェクションは不正なSQLを実行させる攻撃、OSコマンドインジェクションは別の攻撃です。"},
  {"g":"セキュリティ","q":"不正アクセス禁止法は、他人のユーザIDやパスワードを不正に取得する行為も対象とする。","a":"A","e":"他人のID・パスワードを取得・保管・提供する行為も禁止されています。"},
  {"g":"セキュリティ","q":"パスワードは、他人に推測されにくいように生年月日など覚えやすい情報を使うとよい。","a":"B","e":"生年月日や電話番号など推測されやすい情報の利用は避けるべきです。"},
  {"g":"セキュリティ","q":"アクセス制御では、最小権限の原則が重要である。","a":"A","e":"業務遂行に必要な最小限の権限だけを付与する考え方です。"},
  {"g":"セキュリティ","q":"TLSは、Web通信の暗号化に用いられるプロトコルであり、HTTPSなどで利用される。","a":"A","e":"以前はSSLと呼ばれていた仕組みの後継プロトコルです。"},

  {"g":"アルゴリズム・データ構造","q":"スタックは先入れ先出し(FIFO)のデータ構造である。","a":"B","e":"スタックは後入れ先出し(LIFO)、キューがFIFOです。"},
  {"g":"アルゴリズム・データ構造","q":"キューは、先に入れたデータが先に取り出されるデータ構造である。","a":"A","e":"先入れ先出し(FIFO)構造とも呼ばれます。"},
  {"g":"アルゴリズム・データ構造","q":"線形探索は、配列がソートされている必要がある。","a":"B","e":"線形探索は順番に調べるだけなのでソート不要です。"},
  {"g":"アルゴリズム・データ構造","q":"2分探索は、探索対象が昇順または降順に整列されていることが前提となる。","a":"A","e":"中央の要素と比較しながら半分に絞って探索します。"},
  {"g":"アルゴリズム・データ構造","q":"バブルソートの時間計算量は、一般にO(n^2)である。","a":"A","e":"隣り合う要素を交換しながら並べ替える単純なソートです。"},
  {"g":"アルゴリズム・データ構造","q":"クイックソートは、平均的には高速だが、最悪の場合O(n^2)となることがある。","a":"A","e":"分割の偏りが大きいと性能が劣化します。"},
  {"g":"アルゴリズム・データ構造","q":"ヒープソートは、平均・最悪いずれの場合もO(n log n)で動作する。","a":"A","e":"ヒープ構造を用いて効率的に最大値(最小値)を取り出すソートです。"},
  {"g":"アルゴリズム・データ構造","q":"グラフ探索のDFS(深さ優先探索)は、行けるところまで深く進んでから戻る探索方法である。","a":"A","e":"スタックや再帰呼び出しを利用して実装されます。"},
  {"g":"アルゴリズム・データ構造","q":"ハッシュ法では、同じキーからは常に同じハッシュ値が計算される。","a":"A","e":"ただし異なるキーが同じ値になる衝突は発生し得ます。"},
  {"g":"アルゴリズム・データ構造","q":"オーダ記法O(n)は、データ数が2倍になると処理時間も必ず2倍になることを意味する。","a":"B","e":"あくまで漸近的な増加の目安であり、定数倍は考慮されません。"},
  {"g":"アルゴリズム・データ構造","q":"再帰呼び出しを使うアルゴリズムは必ずしもスタックを使用しない。","a":"B","e":"一般的な実装では、関数呼び出しごとにスタックフレームが積まれます。"},
  {"g":"アルゴリズム・データ構造","q":"隣接行列と隣接リストは、ともにグラフ構造を表現する方法である。","a":"A","e":"密なグラフか疎なグラフかで使い分けます。"},

  {"g":"開発プロセス・設計","q":"ウォーターフォールモデルは、上流工程から下流工程へと一方向に進めていく開発モデルである。","a":"A","e":"要件定義→設計→実装→テスト→運用のように段階的に進めます。"},
  {"g":"開発プロセス・設計","q":"ウォーターフォールモデルは、要件変更への柔軟な対応が得意である。","a":"B","e":"後戻りがしにくく、要件が固まっている場合に適しています。"},
  {"g":"開発プロセス・設計","q":"アジャイル開発は、短いイテレーションを繰り返しながらシステムを育てていく開発手法である。","a":"A","e":"ユーザとの対話とフィードバックを重視します。"},
  {"g":"開発プロセス・設計","q":"プロトタイピングモデルでは、試作品を作成して利用者とイメージを共有する。","a":"A","e":"要求のあいまいさを解消するのに有効です。"},
  {"g":"開発プロセス・設計","q":"UMLのユースケース図は、システム内部のクラス構造を表すための図である。","a":"B","e":"ユースケース図は利用者とシステムの関係を表し、クラス構造はクラス図で表現します。"},
  {"g":"開発プロセス・設計","q":"結合度はモジュール同士の依存の強さを表し、結合度が高いほど保守性が高い。","a":"B","e":"一般に結合度は低い方が保守性が高くなります。"},
  {"g":"開発プロセス・設計","q":"凝集度はモジュール内部の機能のまとまりの強さを表し、凝集度が高いほど望ましい。","a":"A","e":"一つの目的のために機能がよくまとまっているほど良い設計とされます。"},
  {"g":"開発プロセス・設計","q":"ブラックボックステストでは、内部構造を理解したうえで網羅的にテストケースを作成する。","a":"B","e":"ブラックボックスは仕様に基づくテストであり、内部構造は考慮しません。"},
  {"g":"開発プロセス・設計","q":"ホワイトボックステストでは、命令網羅や分岐網羅など、実装構造に基づいてテストケースを作成する。","a":"A","e":"プログラムの内部構造を意識してテストします。"},
  {"g":"開発プロセス・設計","q":"レビューは、ドキュメントやプログラムを他者が確認し、欠陥の早期発見を図る活動である。","a":"A","e":"設計段階での欠陥検出は手戻り削減につながります。"},
  {"g":"開発プロセス・設計","q":"テストケースの設計に同値分割法を用いると、入力値を代表値に絞ることができる。","a":"A","e":"無数にある入力パターンをいくつかの代表値にまとめて効率化します。"},
  {"g":"開発プロセス・設計","q":"バグが1つもない完璧なソフトウェアを作ることは現実的に可能である。","a":"B","e":"現実には欠陥ゼロを保証することは難しく、リスクを許容レベルまで下げる考え方が一般的です。"},

  {"g":"マネジメント・ストラテジ","q":"ガントチャートは、プロジェクトのスケジュールを棒グラフ形式で表したものである。","a":"A","e":"タスクの期間と順序関係を視覚的に確認できます。"},
  {"g":"マネジメント・ストラテジ","q":"クリティカルパスは、プロジェクトに余裕のある経路を示し、多少の遅れが許される。","a":"B","e":"クリティカルパスは全体の工期に直接影響する最長経路で、遅れが許されません。"},
  {"g":"マネジメント・ストラテジ","q":"スコープ管理は、プロジェクトで実施すべき作業の範囲を定め、変更を管理するプロセスである。","a":"A","e":"スコープの肥大化(スコープクリープ)を防ぐことも重要です。"},
  {"g":"マネジメント・ストラテジ","q":"リスクは、プロジェクトに悪影響を与える可能性のある事象のみを指す。","a":"B","e":"本来リスクには好影響を与えるプラスのリスクも含まれます。"},
  {"g":"マネジメント・ストラテジ","q":"ROI(投資収益率)は、利益を投資額で割った指標であり、値が大きいほど投資効率が良い。","a":"A","e":"投資判断の一つの指標として利用されます。"},
  {"g":"マネジメント・ストラテジ","q":"SWOT分析の機会(Opportunity)は、自社の内部要因である。","a":"B","e":"機会と脅威は外部環境、強みと弱みは内部環境です。"},
  {"g":"マネジメント・ストラテジ","q":"プロダクトライフサイクルにおける成長期は、市場が拡大し売上が急激に伸びる段階である。","a":"A","e":"導入期→成長期→成熟期→衰退期と推移します。"},
  {"g":"マネジメント・ストラテジ","q":"情報システム戦略は、企業全体の経営戦略とは無関係に立案される。","a":"B","e":"経営戦略と整合した情報システム戦略を策定することが重要です。"},
  {"g":"マネジメント・ストラテジ","q":"デジタルトランスフォーメーション(DX)は、単に紙を電子化するだけの取り組みを指す。","a":"B","e":"DXはビジネスモデルや組織を含めた変革を目指す概念です。"},
  {"g":"マネジメント・ストラテジ","q":"システム監査は、情報システムが適切に計画・運用・管理されているかを独立した立場から評価する活動である。","a":"A","e":"客観的な立場から問題点や改善点を指摘します。"},
  {"g":"マネジメント・ストラテジ","q":"個人情報保護法における個人情報は、生存する個人に関する情報を対象とする。","a":"A","e":"死亡した個人に関する情報は原則として対象外です。"},
  {"g":"マネジメント・ストラテジ","q":"ITガバナンスは、ITの活用によって企業価値を高めつつ、リスクを適切に管理する仕組みを指す。","a":"A","e":"経営者のリーダシップのもとでITを戦略的に活用する考え方です。"},
  {"g":"ハードウェア","q":"制御装置は、命令を解読し各装置への制御信号を出す役割を持つ。","a":"A","e":"CPU内部では制御装置が命令解読と制御信号の生成を担当します。"},
  {"g":"ハードウェア","q":"ALU(算術論理演算装置)は、論理演算のみを行い、算術演算は行わない。","a":"B","e":"ALUは加減算などの算術演算とAND, ORなどの論理演算の両方を行います。"},
  {"g":"ハードウェア","q":"命令パイプラインは、複数の命令を段階的に重ねて実行し、スループットを向上させる。","a":"A","e":"フェッチ・デコード・実行などを並行させて処理性能を高めます。"},
  {"g":"ハードウェア","q":"RISCプロセッサは、複雑な命令を多数持つことで性能を高める方式である。","a":"B","e":"RISCは少数の単純な命令を高速に実行する設計思想です。複雑な命令を多数持つのはCISCです。"},
  {"g":"ハードウェア","q":"マルチコアCPUは、1つのチップの中に複数の演算コアを持つ。","a":"A","e":"並列に処理することで性能向上や省電力を図ります。"},
  {"g":"ハードウェア","q":"システムバスは、コンピュータ内部でCPUと主記憶や入出力装置を接続する信号線群である。","a":"A","e":"データバス・アドレスバス・制御バスなどで構成されます。"},
  {"g":"ハードウェア","q":"LCDは発光素子そのもので光を出すため、バックライトを必要としない。","a":"B","e":"液晶ディスプレイ(LCD)は自ら光らないため、バックライトが必要です。"},
  {"g":"ハードウェア","q":"レーザプリンタは、トナーと感光体ドラムを用いて印刷する。","a":"A","e":"ドラム上にレーザで静電パターンを形成し、トナーを付着させて紙に転写します。"},
  {"g":"ハードウェア","q":"インクジェットプリンタは、主に熱や圧力によりインクを微小な粒として紙に吹き付けて印刷する。","a":"A","e":"熱方式やピエゾ方式などが使われます。"},
  {"g":"ハードウェア","q":"SSDはHDDと比べて機械的駆動部が無いため、耐衝撃性やアクセス速度に優れる。","a":"A","e":"半導体メモリを用いるため静粛で省電力でもあります。"},
  {"g":"ハードウェア","q":"HDDは、データの読み書きにフラッシュメモリを用いる。","a":"B","e":"HDDは磁性体を塗布した円盤を高速回転させ、磁気ヘッドで読み書きします。"},
  {"g":"ハードウェア","q":"タッチパネルは一般に入力装置として分類される。","a":"A","e":"ユーザの指やペンの位置情報を入力する装置です。"},
  {"g":"ハードウェア","q":"バーコードリーダやICカードリーダは、外部から情報を読み取る入力装置である。","a":"A","e":"読み取った情報をコンピュータに入力します。"},
  
  {"g":"OS・プロセス","q":"タイムシェアリングシステムでは、CPU時間を細かい単位に分割して複数のユーザに時間的に共有させる。","a":"A","e":"各ユーザのタスクを高速に切り替えることで同時利用しているように見せます。"},
  {"g":"OS・プロセス","q":"マルチプログラミングでは、主記憶上に同時に複数のプログラムをロードし、CPUを切り替えながら実行する。","a":"A","e":"CPUと入出力装置の待ち時間を有効利用してスループットを高めます。"},
  {"g":"OS・プロセス","q":"スワッピングは、プロセス全体を主記憶と補助記憶の間で入れ替える方式である。","a":"A","e":"古典的な主記憶管理方式の一つで、プロセス単位で入れ替えます。"},
  {"g":"OS・プロセス","q":"スプーリングは、高速なCPUの処理を一時的に遅らせて、入出力装置の速度に合わせることを目的とする。","a":"A","e":"一旦ディスクに溜め込むことで、CPUとプリンタなどの低速装置の速度差を吸収します。"},
  {"g":"OS・プロセス","q":"ラウンドロビン方式では、各プロセスに割り当てられるCPU時間(タイムクウォンタム)は固定長である。","a":"A","e":"一定時間ごとに次のプロセスへと切り替えます。"},
  {"g":"OS・プロセス","q":"優先度スケジューリングでは、優先度の高いプロセスほど実行が後回しにされる。","a":"B","e":"優先度の高いプロセスが先に実行されるようにスケジューリングされます。"},
  {"g":"OS・プロセス","q":"スレッドを用いると、プロセス間でメモリ空間を共有しないため、コンテキストスイッチのオーバーヘッドが大きくなる。","a":"B","e":"同一プロセス内のスレッドはメモリ空間を共有するため、コンテキストスイッチのオーバーヘッドは比較的小さくなります。"},
  {"g":"OS・プロセス","q":"プリエンプティブなスケジューリングでは、実行中プロセスを強制的に中断することができる。","a":"A","e":"タイムシェアリングOSで用いられる仕組みです。"},
  {"g":"OS・プロセス","q":"ノンプリエンプティブなスケジューリングでは、プロセス自身がCPUを明け渡すまで実行が継続される。","a":"A","e":"協調的な切り替え方式で、リアルタイム性は低くなりがちです。"},
  {"g":"OS・プロセス","q":"カーネルモードでは、入出力制御やメモリ管理などの特権命令を実行できる。","a":"A","e":"ユーザモードでは実行できないハードウェア制御を行います。"},
  {"g":"OS・プロセス","q":"ユーザモードでは、アプリケーションプログラムはOSの機能を直接ハードウェアに対して実行できる。","a":"B","e":"ユーザモードのプログラムはシステムコールを通じてOSにサービスを依頼します。"},
  {"g":"OS・プロセス","q":"割り込みは、CPUに対して現在の処理を一時停止して別の処理を要求する仕組みである。","a":"A","e":"外部装置からの要求や内部例外などで発生します。"},
  
  {"g":"ネットワーク","q":"イーサネットにおけるCSMA/CD方式は、有線LANでの衝突検出に用いられる。","a":"A","e":"送信前にキャリアを検出し、衝突が起きたら再送制御を行います。"},
  {"g":"ネットワーク","q":"Wi-Fiは、IEEE 802.11シリーズの規格に基づく無線LANの総称である。","a":"A","e":"家庭やオフィスで利用される無線LAN通信方式です。"},
  {"g":"ネットワーク","q":"ARPは、IPアドレスからMACアドレスを求めるプロトコルである。","a":"A","e":"同一ネットワーク内でのアドレス解決に用いられます。"},
  {"g":"ネットワーク","q":"SMTPは、電子メールの受信に用いられるプロトコルである。","a":"B","e":"SMTPは送信側、受信はPOP3やIMAPなどが用いられます。"},
  {"g":"ネットワーク","q":"POP3は、メールサーバからメールクライアントへメールを受信するために用いられる。","a":"A","e":"IMAPと違い、基本的にはローカルにメールを取り込む方式です。"},
  {"g":"ネットワーク","q":"FTPは、ファイルの転送に用いられるアプリケーション層のプロトコルである。","a":"A","e":"TCPを利用し、ポート番号20・21番などを使います。"},
  {"g":"ネットワーク","q":"DHCPは、IPアドレスやデフォルトゲートウェイなどの情報を自動的にクライアントに割り当てる。","a":"A","e":"ネットワーク管理者の負担軽減や設定ミス防止に役立ちます。"},
  {"g":"ネットワーク","q":"ISPは、インターネットに接続するための回線設備のみを提供し、IPアドレスは提供しない事業者である。","a":"B","e":"ISP(インターネットサービスプロバイダ)は回線とあわせてIPアドレスなども提供します。"},
  {"g":"ネットワーク","q":"DMZ(非武装地帯)は、インターネットと内部ネットワークの中間に置くセグメントである。","a":"A","e":"Webサーバなどを配置し、内部ネットワークを直接インターネットに晒さないようにします。"},
  {"g":"ネットワーク","q":"プロキシサーバは、クライアントの代わりに外部サーバと通信する中継サーバである。","a":"A","e":"キャッシュやアクセス制御などの機能も兼ねることがあります。"},
  {"g":"ネットワーク","q":"帯域幅が大きい回線ほど、一般に一度に送れるデータ量が多い。","a":"A","e":"ビットレートが高いほど単位時間あたりの伝送量が増えます。"},
  {"g":"ネットワーク","q":"レイテンシ(遅延時間)は、データを大量に送るほど必ず小さくなる。","a":"B","e":"遅延は回線品質や距離、混雑状況などに依存し、データ量とは別の指標です。"},
  {"g":"ネットワーク","q":"パケット交換方式では、通信データを固定長の回線単位として扱い、常に回線を占有して通信する。","a":"B","e":"パケット交換はデータを小さな単位に分割して、共有の回線上を動的に流します。"},
  
  {"g":"データベース","q":"第2正規形では、主キーが複合キーの場合、主キーの一部にのみ関数従属する項目を分離する。","a":"A","e":"部分関数従属を排除するのが第2正規形の目的です。"},
  {"g":"データベース","q":"第3正規形では、非キー属性が他の非キー属性に関数従属していないことが条件となる。","a":"A","e":"推移的関数従属を排除することで冗長性を減らします。"},
  {"g":"データベース","q":"参照整合性制約は、外部キーが参照する先の主キーが必ず存在することを保証する。","a":"A","e":"親レコードが無い子レコードを登録できないように制約します。"},
  {"g":"データベース","q":"SQLのINSERT文は、既存行の削除に用いられる。","a":"B","e":"INSERTは追加、削除はDELETE、更新はUPDATEです。"},
  {"g":"データベース","q":"GROUP BY句を用いると、指定した列ごとに集計処理を行うことができる。","a":"A","e":"COUNTやSUMなどの集約関数と組み合わせて利用します。"},
  {"g":"データベース","q":"HAVING句は、GROUP BYでグループ化した後の集計結果に対する条件指定に用いられる。","a":"A","e":"WHEREは行に対する条件、HAVINGはグループに対する条件です。"},
  {"g":"データベース","q":"トランザクションのコミットは、それまでの処理結果を取り消す操作である。","a":"B","e":"コミットは確定、ロールバックが取り消しです。"},
  {"g":"データベース","q":"分散データベースでは、複数の物理サイトにデータを分散配置して1つのデータベースのように扱う。","a":"A","e":"場所の透過性や障害分散などのメリットがあります。"},
  {"g":"データベース","q":"インデックスを過剰に付与すると、更新処理時のオーバーヘッドが増えることがある。","a":"A","e":"INSERT/UPDATE/DELETE時にインデックスも更新されるためです。"},
  {"g":"データベース","q":"ロック機構は、同時更新に伴う不整合を防ぐために用いられる。","a":"A","e":"排他制御の代表的な手法です。"},
  {"g":"データベース","q":"楽観的排他制御は、更新のたびに必ずロックを取得して競合を防ぐ方式である。","a":"B","e":"楽観的排他はロックを行わず、コミット時に競合の有無を検査します。"},
  {"g":"データベース","q":"悲観的排他制御は、競合が起こらないと楽観してロックをかけない方式である。","a":"B","e":"悲観的排他は競合が起こる前提でロックを取得します。"},
  {"g":"データベース","q":"データウェアハウスは、日々のオンライン処理を高速化するために最適化された運用系データベースを指す。","a":"B","e":"データウェアハウスは分析や意思決定支援のために統合・蓄積されたデータベースです。"},
  
  {"g":"セキュリティ","q":"辞書攻撃は、よく使われる単語やパターンを試してパスワードを推測する攻撃である。","a":"A","e":"単語リストやよくある文字列の組合せを総当たりします。"},
  {"g":"セキュリティ","q":"総当たり攻撃(ブルートフォース攻撃)は、可能な組合せをすべて試すことでパスワードを破ろうとする攻撃である。","a":"A","e":"桁数が大きいと現実的な時間では突破が困難になります。"},
  {"g":"セキュリティ","q":"ソーシャルエンジニアリングは、技術的な手法のみを用いてシステムに侵入する攻撃である。","a":"B","e":"人間の心理や不注意を突いて情報を盗み出す非技術的な手口です。"},
  {"g":"セキュリティ","q":"フィッシング攻撃は、本物と偽ったメールやWebサイトで利用者のIDやパスワードを盗み取る。","a":"A","e":"偽のログイン画面へ誘導して情報を入力させます。"},
  {"g":"セキュリティ","q":"ランサムウェアは、データを暗号化して利用不能にし、身代金を要求するマルウェアである。","a":"A","e":"バックアップやパッチ適用、メールの添付ファイル対策などが重要です。"},
  {"g":"セキュリティ","q":"ワームは、自己増殖機能を持たないマルウェアであり、必ず他のファイルに寄生する。","a":"B","e":"自己増殖機能を持つのがワームで、他のプログラムに寄生するのがウイルスです。"},
  {"g":"セキュリティ","q":"トロイの木馬型マルウェアは、一見有用なソフトウェアに見せかけて内部に不正な機能を持つ。","a":"A","e":"利用者自身にインストールさせる点が特徴です。"},
  {"g":"セキュリティ","q":"ワンタイムパスワードは、1度しか使えないパスワードであり、パスワード盗聴への耐性が高い。","a":"A","e":"使い回しができないため、盗聴されても再利用が困難です。"},
  {"g":"セキュリティ","q":"多要素認証では、「知っているもの」「持っているもの」「本人であること」など複数の要素を組み合わせる。","a":"A","e":"ID・パスワードに加えてトークンや生体情報などを併用します。"},
  {"g":"セキュリティ","q":"ログの保全は、インシデント発生時の原因調査や不正アクセスの証拠保全に役立つ。","a":"A","e":"改ざんされないよう適切に保存・管理することが重要です。"},
  {"g":"セキュリティ","q":"脆弱性対応では、ベンダが提供するセキュリティパッチを適用することも重要な対策の一つである。","a":"A","e":"既知の脆弱性を放置すると攻撃に悪用される危険があります。"},
  {"g":"セキュリティ","q":"情報セキュリティポリシは、組織が従うべきルールを文書化したものであり、従業員教育の基礎となる。","a":"A","e":"ルールを定めるだけでなく、周知徹底と運用が重要です。"},
  {"g":"セキュリティ","q":"BCP(事業継続計画)は、災害などにより事業が停止した場合の復旧手順や体制をあらかじめ定める計画である。","a":"A","e":"ITシステムだけでなく、人員や拠点も含めた事業継続を考えます。"},
  
  {"g":"アルゴリズム・データ構造","q":"挿入ソートは、すでにほぼ整列済みのデータに対しては比較的高速に動作する。","a":"A","e":"要素の移動量が少ない場合は効率よく動作します。"},
  {"g":"アルゴリズム・データ構造","q":"選択ソートは、常に最小(または最大)の要素を選び出して先頭から並べるソートである。","a":"A","e":"比較回数は多いものの、実装は単純なソートです。"},
  {"g":"アルゴリズム・データ構造","q":"マージソートは、配列を分割と統合を繰り返して整列するアルゴリズムであり、計算量はO(n log n)である。","a":"A","e":"安定なソートであり、外部ソートなどにも利用されます。"},
  {"g":"アルゴリズム・データ構造","q":"グラフの幅優先探索(BFS)では、ある頂点に近い順に探索を進める。","a":"A","e":"キューを用いて隣接頂点を順に探索します。"},
  {"g":"アルゴリズム・データ構造","q":"ダイクストラ法は、負の重みを含むグラフでも常に正しい最短経路を求めることができる。","a":"B","e":"ダイクストラ法は辺の重みが非負であることが前提です。"},
  {"g":"アルゴリズム・データ構造","q":"動的計画法(DP)は、問題を部分問題に分割し、その解を再利用することで効率的に解く手法である。","a":"A","e":"ナップサック問題や最長共通部分列問題などに用いられます。"},
  {"g":"アルゴリズム・データ構造","q":"貪欲法(グリーディ法)は、各段階でそのとき最善と思われる選択を行い、全体としても最適解を必ず保証する手法である。","a":"B","e":"必ずしも最適解を保証しませんが、簡易な近似解として有用な場合があります。"},
  {"g":"アルゴリズム・データ構造","q":"NP完全問題は、多項式時間アルゴリズムが存在しないことが証明されている問題群である。","a":"B","e":"多項式時間アルゴリズムが存在するかどうかは未解決であり、P=NP問題として知られています。"},
  {"g":"アルゴリズム・データ構造","q":"平均計算量がO(1)であるデータ構造の例として、適切に設計されたハッシュテーブルが挙げられる。","a":"A","e":"衝突が少ない場合、探索・挿入・削除が平均O(1)で行えます。"},
  {"g":"アルゴリズム・データ構造","q":"再帰アルゴリズムは、必ずしも終了条件を必要としない。","a":"B","e":"終了条件が無いと再帰呼び出しが止まらず、スタックオーバーフローになります。"},
  {"g":"アルゴリズム・データ構造","q":"木構造は、サイクル(閉路)を持たない連結なグラフである。","a":"A","e":"ノード間に閉路を持たない階層構造を表すグラフです。"},
  {"g":"アルゴリズム・データ構造","q":"二分木では、各ノードの子ノード数は最大3つである。","a":"B","e":"二分木では各ノードの子ノード数は最大2つです。"},
  {"g":"アルゴリズム・データ構造","q":"平衡二分探索木では、探索・挿入・削除の計算量は平均してO(log n)となる。","a":"A","e":"高さを抑えることで効率的な操作を実現します。"},
  
  {"g":"開発プロセス・設計","q":"テストのV字モデルでは、上流工程の成果物に対応するテスト工程を意識して設計する。","a":"A","e":"要件には受入テスト、基本設計にはシステムテストといった対応付けを行います。"},
  {"g":"開発プロセス・設計","q":"単体テストは、システム全体の機能が要件どおりに動作するかを確認するテストである。","a":"B","e":"単体テストはモジュール単位、システム全体はシステムテストや受入テストの対象です。"},
  {"g":"開発プロセス・設計","q":"結合テストは、モジュール間のインタフェースやデータの受け渡しが正しく行われるかを確認する。","a":"A","e":"モジュール同士を組み合わせた際の不具合を検出します。"},
  {"g":"開発プロセス・設計","q":"仕様バグは、プログラムのコーディングミスによって発生する欠陥を指す。","a":"B","e":"仕様そのものの誤りが仕様バグであり、実装ミスはコーディングバグです。"},
  {"g":"開発プロセス・設計","q":"リグレッションテスト(回帰テスト)は、修正によって他の部分に悪影響が出ていないか確認するテストである。","a":"A","e":"不具合修正や機能追加の後に実施します。"},
  {"g":"開発プロセス・設計","q":"オブジェクト指向におけるカプセル化は、データとそれを操作する手続きを1つのまとまりとして隠蔽する考え方である。","a":"A","e":"内部実装を隠し、インタフェースだけを公開します。"},
  {"g":"開発プロセス・設計","q":"オブジェクト指向における継承は、既存クラスの属性や操作を引き継いで新しいクラスを定義する仕組みである。","a":"A","e":"共通部分の再利用や拡張に役立ちます。"},
  {"g":"開発プロセス・設計","q":"ポリモーフィズム(多態性)は、同じメッセージに対して異なるクラスが異なる振る舞いを示す性質である。","a":"A","e":"インタフェースは同じでも実装が異なるメソッドを呼び分けます。"},
  {"g":"開発プロセス・設計","q":"スパゲッティプログラムとは、構造化されておらず、制御の流れが複雑に入り組んだ保守しやすいプログラムを指す。","a":"B","e":"保守しにくいプログラムの典型例としてスパゲッティプログラムと言われます。"},
  {"g":"開発プロセス・設計","q":"モジュール分割では、1つのモジュールができるだけ多くの役割を持つようにするのが望ましい。","a":"B","e":"1モジュール1責務に近づけることで保守性や再利用性が高まります。"},
  {"g":"開発プロセス・設計","q":"レビューやインスペクションは、テストより前の段階で欠陥を見つける有効な手法である。","a":"A","e":"設計書やコードを人間の目で確認することで早期に問題を発見します。"},
  {"g":"開発プロセス・設計","q":"CASEツールは、要件定義から設計・実装・テストまでの開発工程を支援するソフトウェアである。","a":"A","e":"設計図の作成、コード生成、テスト支援などさまざまなツールがあります。"},
  {"g":"開発プロセス・設計","q":"リファクタリングは、外部から見たプログラムの振る舞いを変えずに内部構造を改善する作業である。","a":"A","e":"可読性や保守性を高め、将来の変更を容易にします。"},
  
  {"g":"マネジメント・ストラテジ","q":"WBS(Work Breakdown Structure)は、プロジェクトの成果物や作業を階層的に分解した図である。","a":"A","e":"タスクの抜け漏れ防止や見積りの基礎として利用します。"},
  {"g":"マネジメント・ストラテジ","q":"EVM(アーンドバリューマネジメント)では、出来高や予定コストなどを用いて進捗とコストを分析する。","a":"A","e":"EV, PV, ACなどの指標を使ってプロジェクトの状況を把握します。"},
  {"g":"マネジメント・ストラテジ","q":"スコープクリープとは、合意された範囲が知らないうちに縮小してしまう現象を指す。","a":"B","e":"スコープクリープは、逆に範囲がだんだん膨らんでいく現象です。"},
  {"g":"マネジメント・ストラテジ","q":"ステークホルダとは、プロジェクトやシステムに利害関係を持つ関係者全般を指す。","a":"A","e":"顧客、ユーザ、経営者、開発メンバなどが含まれます。"},
  {"g":"マネジメント・ストラテジ","q":"ITILは、情報システムのサービス運用に関するベストプラクティスを体系化したフレームワークである。","a":"A","e":"インシデント管理や問題管理、変更管理などのプロセスが定義されています。"},
  {"g":"マネジメント・ストラテジ","q":"クラウドコンピューティングでは、利用者は一般に必要なときに必要な量だけリソースを利用できる。","a":"A","e":"オンデマンド性や弾力性がクラウドの特徴です。"},
  {"g":"マネジメント・ストラテジ","q":"SaaSは、利用者がハードウェア資源のみを借りて、自分でOSやミドルウェアをインストールする形態である。","a":"B","e":"それはIaaSに近い形態であり、SaaSはアプリケーションをサービスとして提供します。"},
  {"g":"マネジメント・ストラテジ","q":"IaaSは、仮想サーバやストレージなどの基盤をサービスとして提供する形態である。","a":"A","e":"利用者はその上にOSやミドルウェア、アプリケーションを構築します。"},
  {"g":"マネジメント・ストラテジ","q":"DX(デジタルトランスフォーメーション)は、デジタル技術を活用してビジネスモデルや業務、企業文化を変革する取り組みである。","a":"A","e":"単なるIT導入や紙の電子化にとどまらない変革が求められます。"},
  {"g":"マネジメント・ストラテジ","q":"BPR(ビジネスプロセス・リエンジニアリング)は、既存の業務プロセスをゼロベースで見直し、抜本的に再設計する考え方である。","a":"A","e":"部分的な改善ではなく、根本的な改革を目指します。"},
  {"g":"マネジメント・ストラテジ","q":"情報システム部門は、経営戦略とは切り離されて独立にシステムを企画・導入すべきである。","a":"B","e":"経営戦略と整合した情報システム戦略が重要です。"},
  {"g":"マネジメント・ストラテジ","q":"システム化構想では、現状業務の分析だけでなく、将来像やあるべき姿を踏まえた検討が必要である。","a":"A","e":"単なる現状の延長ではなく、将来のビジネスを支えるシステム像を描きます。"},
  {"g":"マネジメント・ストラテジ","q":"情報システムの外部委託では、委託先との契約内容やSLA(サービスレベル合意)を明確にしておくことが重要である。","a":"A","e":"品質・範囲・責任分担などを明確化し、トラブルを防ぎます。"},
  {"g":"計算問題","q":"2進数 1010(2) を10進数に変換すると 10 である。","a":"A","e":"1010₂＝8+2＝10です。"},
  {"g":"計算問題","q":"2進数 1101(2) を10進数に変換すると 13 である。","a":"A","e":"1101₂＝8+4+1＝13です。"},
  {"g":"計算問題","q":"2進数 10000(2) は10進数で 8 である。","a":"B","e":"10000₂＝16です。"},
  {"g":"計算問題","q":"10進数 7 を2進数にすると 111 である。","a":"A","e":"4+2+1＝7なので 111₂ です。"},
  {"g":"計算問題","q":"10進数 12 を2進数にすると 1100 である。","a":"A","e":"8+4＝12なので 1100₂ です。"},
  {"g":"計算問題","q":"10進数 9 を2進数にすると 1001 である。","a":"A","e":"8+1＝9なので 1001₂ です。"},
  {"g":"計算問題","q":"10進数 5 を2進数にすると 100 である。","a":"B","e":"5＝4+1なので 101₂ が正しい表現です。"},
  {"g":"計算問題","q":"2進数 1111(2) は10進数で 14 である。","a":"B","e":"1111₂＝8+4+2+1＝15です。"},
  {"g":"計算問題","q":"2進数 100000(2) は10進数で 32 である。","a":"A","e":"2⁵＝32なので 100000₂ です。"},
  {"g":"計算問題","q":"2進数 10101(2) は10進数で 20 である。","a":"B","e":"10101₂＝16+4+1＝21です。"},
  {"g":"計算問題","q":"4ビットで表せる最大の10進数は 15 である。","a":"A","e":"2⁴−1＝15です。"},
  {"g":"計算問題","q":"4ビットで表せる値の通り数は 15 通りである。","a":"B","e":"0～15の16通りなので 16 が正しいです。"},
  {"g":"計算問題","q":"8ビットで表せる最大の10進数は 255 である。","a":"A","e":"2⁸−1＝255です。"},
  {"g":"計算問題","q":"nビットで表せる値の通り数は 2^(n−1) 通りである。","a":"B","e":"0～2ⁿ−1の 2ⁿ 通りです。"},
  {"g":"計算問題","q":"2の10乗は 1024 である。","a":"A","e":"2¹⁰＝1024で、キロ(キビ)の基礎です。"},
  {"g":"計算問題","q":"2の16乗は 65536 である。","a":"A","e":"アドレス16ビットで表せる個数 2¹⁶＝65536です。"},
  {"g":"計算問題","q":"アドレス長16ビットの主記憶では、65536個のアドレスを指定できる。","a":"A","e":"2¹⁶＝65536 アドレスです。"},
  {"g":"計算問題","q":"10ビットで表せる最大の10進数は 1023 である。","a":"A","e":"2¹⁰−1＝1023です。"},
  {"g":"計算問題","q":"AND演算は、どちらか一方でも1なら1になる。","a":"B","e":"ANDは両方1のときだけ1です。"},
  {"g":"計算問題","q":"OR演算は、どちらか一方が1なら1になる。","a":"A","e":"どちらか、または両方が1なら1です。"},
  {"g":"計算問題","q":"排他的論理和(XOR)は、2つのビットが同じとき1になる。","a":"B","e":"XORは異なるとき1、同じとき0です。"},
  {"g":"計算問題","q":"2進数の AND 演算 1010 AND 1100 の結果は 1000 である。","a":"A","e":"各桁をANDすると 1 0 0 0 になります。"},
  {"g":"計算問題","q":"2進数の OR 演算 1010 OR 0101 の結果は 1111 である。","a":"A","e":"どちらかが1なら1なので 1111 です。"},
  {"g":"計算問題","q":"2進数の XOR 演算 1010 XOR 0101 の結果は 0000 である。","a":"B","e":"すべての桁で異なるので 1111 になります。"},
  {"g":"計算問題","q":"NOT演算では、0は1に、1は0に反転される。","a":"A","e":"単純なビット反転です。"},
  {"g":"計算問題","q":"真理値 A＝真、B＝偽 のとき、A AND B は真である。","a":"B","e":"ANDは片方が偽なら偽です。"},
  {"g":"計算問題","q":"2進数の左シフト1ビットは、10進数で2倍にする効果がある。","a":"A","e":"例えば 3(11₂) を左シフトすると 6(110₂) になります。"},
  {"g":"計算問題","q":"2進数の右シフト1ビットは、10進数でおおよそ2分の1にする効果がある。","a":"A","e":"端数は切り捨てですが、基本的には÷2の効果です。"},
  {"g":"計算問題","q":"10進数 6(0110₂) を左に1ビットシフトすると、10進数で 12 になる。","a":"A","e":"0110₂→1100₂＝8+4＝12です。"},
  {"g":"計算問題","q":"10進数 9(1001₂) を右に1ビットシフトすると、10進数で 5 になる。","a":"B","e":"1001₂→0100₂＝4なので 4 です。"},
  {"g":"計算問題","q":"1バイトは 8ビット で構成される。","a":"A","e":"1byte＝8bit は基本単位です。"},
  {"g":"計算問題","q":"1キロバイト(KB)は 1024 バイトである。","a":"A","e":"2¹⁰＝1024B を1KBとみなします。"},
  {"g":"計算問題","q":"1024KB は 1メガバイト(MB)である。","a":"A","e":"1024×1024B＝1MBです。"},
  {"g":"計算問題","q":"1メガバイト(MB)は 1000KB である。","a":"B","e":"情報処理では通常 1MB＝1024KB と扱います。"},
  {"g":"計算問題","q":"1ギガバイト(GB)は、おおよそ 1024MB として扱われる。","a":"A","e":"2の冪に基づくバイナリ表現では 1GB＝1024MB です。"},
  {"g":"計算問題","q":"2メガバイト(MB)は、2048キロバイト(KB)である。","a":"A","e":"2MB×1024＝2048KBです。"},
  {"g":"計算問題","q":"1024バイトは 1メガバイト である。","a":"B","e":"1024B は 1KB です。"},
  {"g":"計算問題","q":"10MB/s の速度で 20MB のデータを転送すると、およそ 2秒 かかる。","a":"A","e":"20÷10＝2秒です。"},
  {"g":"計算問題","q":"通信速度 100Mbps は、1秒間に約 12.5MB のデータを送れる理論値である。","a":"A","e":"100Mビット÷8＝12.5Mバイト/秒です。"},
  {"g":"計算問題","q":"1.5時間は 5400 秒である。","a":"A","e":"1時間＝3600秒なので 1.5×3600＝5400秒です。"},
  {"g":"計算問題","q":"10分は 1000 秒である。","a":"B","e":"10×60＝600秒です。"},
  {"g":"計算問題","q":"ディスクアクセス時間が、シーク10ms・回転待ち5ms・転送2ms のとき、合計は 17ms である。","a":"A","e":"10+5+2＝17msです。"},
  {"g":"計算問題","q":"クロック周波数 1GHz のCPUの1クロック周期は 1ナノ秒である。","a":"A","e":"1/10⁹秒＝1nsです。"},
  {"g":"計算問題","q":"クロック周波数 2GHz のCPUの1クロック周期は 2ナノ秒である。","a":"B","e":"1/2GHz＝0.5nsです。"},
  {"g":"計算問題","q":"300万クロック必要な処理を1GHzのCPUで実行すると、処理時間は約 3ミリ秒である。","a":"A","e":"300万÷10⁹＝0.003秒＝3msです。"},
  {"g":"計算問題","q":"10Mbps の回線で 1Mビット のデータを送ると、およそ 0.1秒 かかる。","a":"A","e":"1M÷10M＝0.1秒です。"},
  {"g":"計算問題","q":"1Gbps の回線で 1Gバイト のデータを送ると、理論上 1秒で送れる。","a":"B","e":"1Gバイト＝8Gビットなので 8秒程度かかります。"},
  {"g":"計算問題","q":"60fps の動画は、1秒間に 60 枚の画像を表示することを意味する。","a":"A","e":"fps(frames per second)＝毎秒のフレーム数です。"},
  {"g":"計算問題","q":"CPU使用率50%とは、常に半分のクロックが物理的に停止している状態を指す。","a":"B","e":"時間のうち半分だけ仕事をしている状態であり、クロックが止まっているわけではありません。"},
  {"g":"計算問題","q":"キャッシュのヒット率80%、ヒット時10ns、ミス時110ns のとき、平均アクセス時間は 30ns である。","a":"A","e":"0.8×10＋0.2×110＝8＋22＝30nsです。"}
]
