[
  {"g":"セキュリティ基本","q":"情報セキュリティの3要素CIAとは、機密性・完全性・可用性を指す。","a":"A","e":"Confidentiality, Integrity, Availability の頭文字です。"},
  {"g":"セキュリティ基本","q":"完全性とは、情報が許可されていない人に閲覧されないようにする性質を指す。","a":"B","e":"それは機密性です。完全性は情報が正確・完全で改ざんされていない性質です。"},
  {"g":"セキュリティ基本","q":"可用性とは、必要なときに必要な情報が利用できる性質のことである。","a":"A","e":"システム停止や障害があってもサービスを継続できることが重要です。"},
  {"g":"セキュリティ基本","q":"脅威とは、システムや情報資産に損害を与える可能性のある原因を指す。","a":"A","e":"攻撃者・災害・故障・誤操作などが脅威の例です。"},
  {"g":"セキュリティ基本","q":"脆弱性とは、攻撃を受ける可能性の高い重要システムそのものを指す。","a":"B","e":"脆弱性はシステムや運用の“弱点”であり、そこを脅威に突かれると被害が生じます。"},
  {"g":"セキュリティ基本","q":"リスクは、脅威と脆弱性が結び付いたときに発生する損失の可能性を指す。","a":"A","e":"一般にリスク＝発生確率×影響度という考え方で評価します。"},
  {"g":"セキュリティ基本","q":"情報資産には、サーバやPCなどのハードウェアだけが含まれる。","a":"B","e":"データ、ソフトウェア、紙文書、人材、ノウハウなども情報資産です。"},
  {"g":"セキュリティ基本","q":"情報セキュリティ対策は、技術的対策さえしっかりしていれば、組織的・人的対策は不要である。","a":"B","e":"人・組織・技術・物理などをバランスよく実施することが重要です。"},
  {"g":"セキュリティ基本","q":"セキュリティインシデントとは、セキュリティ上望ましくない、またはそのおそれのある事象を指す。","a":"A","e":"インシデントには、実被害だけでなく、未遂や兆候も含めて扱います。"},
  {"g":"セキュリティ基本","q":"ゼロトラストの考え方では、社内ネットワークであれば基本的に信頼してよいとする。","a":"B","e":"ゼロトラストは“何も信頼しない”前提で、すべて検証する考え方です。"},
  {"g":"セキュリティ基本","q":"多層防御とは、複数の対策を重ねることで、一つの対策が突破されても被害を抑える考え方である。","a":"A","e":"ファイアウォール＋IDS/IPS＋エンドポイント対策などを組み合わせます。"},
  {"g":"セキュリティ基本","q":"BYODは、従業員が私物端末を業務に利用することを指し、セキュリティポリシの対象にはならない。","a":"B","e":"私物端末であっても業務に使うならポリシとルールの整備が必要です。"},
  {"g":"セキュリティ基本","q":"クラウド利用時にも、利用者組織側の設定不備がインシデントの原因となりうる。","a":"A","e":"アクセス制御や公開設定の誤りなど“責任共有モデル”を理解する必要があります。"},
  {"g":"セキュリティ基本","q":"セキュリティ文化とは、従業員一人ひとりが自分事としてセキュリティを考え、行動する企業風土を指す。","a":"A","e":"トップの姿勢と教育・啓発が文化づくりに大きく影響します。"},
  {"g":"セキュリティ基本","q":"リスクゼロを目指して、すべての業務を停止することが理想的なセキュリティ対策である。","a":"B","e":"業務継続とのバランスが重要で、現実的なリスク許容レベルを決めて対応します。"},
  {"g":"セキュリティ基本","q":"セキュリティ水準の目標を決める際には、自組織の事業目標や優先順位を考慮する必要がある。","a":"A","e":"ビジネスへの影響を踏まえた“経営課題としてのセキュリティ”が求められます。"},
  {"g":"セキュリティ基本","q":"情報セキュリティマネジメントは、一度仕組みを整えれば、あとは見直し不要の静的な仕組みである。","a":"B","e":"環境変化や新たな脅威に合わせ、継続的な改善が必要です。"},
  {"g":"セキュリティ基本","q":"セキュリティポリシには、経営層のコミットメントが示されていることが望ましい。","a":"A","e":"トップメッセージがあると、全社員に対する説得力と重要性が増します。"},
  {"g":"セキュリティ基本","q":"情報セキュリティは、IT部門だけの問題であり、業務部門は関与する必要はない。","a":"B","e":"業務手順や人の行動が大きく関わるため、全社的な取り組みが必要です。"},
  {"g":"セキュリティ基本","q":"セキュリティ対策を検討する際には、コストと効果を考慮し、優先順位を付けることが重要である。","a":"A","e":"限られた予算の中で、リスクの高い箇所から順に対策を打つ必要があります。"},
  
  {"g":"リスクマネジメント・ISMS","q":"ISMSでは、PDCAサイクルにより継続的な改善を行うことが重視される。","a":"A","e":"Plan-Do-Check-Act のサイクルで仕組みと運用を改善します。"},
  {"g":"リスクマネジメント・ISMS","q":"リスクアセスメントは、リスクの特定・分析・評価のプロセスを含む。","a":"A","e":"資産・脅威・脆弱性を洗い出し、リスクレベルを評価します。"},
  {"g":"リスクマネジメント・ISMS","q":"リスク対応には、リスク受容・リスク低減・リスク回避・リスク移転といった選択肢がある。","a":"A","e":"保険活用やアウトソースはリスク移転の例です。"},
  {"g":"リスクマネジメント・ISMS","q":"リスク受容とは、リスクの存在を無視して、何の記録も残さない方針を採ることである。","a":"B","e":"受容は“許容できる”と判断し、理由も含めて記録したうえで受け入れます。"},
  {"g":"リスクマネジメント・ISMS","q":"残留リスクとは、対策を実施した後もなお残るリスクを指す。","a":"A","e":"対策後のリスクが許容範囲内かを確認することが重要です。"},
  {"g":"リスクマネジメント・ISMS","q":"ISO/IEC 27001は、情報セキュリティマネジメントシステムに関する国際規格である。","a":"A","e":"ISMSの要求事項を定めた規格で、日本ではJIS Q 27001としても規格化されています。"},
  {"g":"リスクマネジメント・ISMS","q":"リスク分析では、定量評価だけが推奨され、定性的評価は用いるべきではない。","a":"B","e":"組織の状況に応じて定性・定量またはその併用が行われます。"},
  {"g":"リスクマネジメント・ISMS","q":"リスク所有者は、特定のリスクに対して責任と権限を持つ人物または組織である。","a":"A","e":"リスクへの対応方針を決める立場の人です。"},
  {"g":"リスクマネジメント・ISMS","q":"リスク対応計画には、実施時期や責任者、必要な資源などを明確にすることが望ましい。","a":"A","e":"“誰がいつまでに何をするか”を明確にすることで実行性が高まります。"},
  {"g":"リスクマネジメント・ISMS","q":"ISMSの内部監査は、運用担当者自身が自己点検として実施するのが望ましい。","a":"B","e":"利害関係からある程度独立した立場の者が実施することが求められます。"},
  {"g":"リスクマネジメント・ISMS","q":"リスクマネジメントは、情報システムに限定され、事業継続や人の安全は対象外である。","a":"B","e":"事業・人的・レピュテーションなど広い観点からリスクを捉える必要があります。"},
  {"g":"リスクマネジメント・ISMS","q":"ISMSにおいて、適用宣言書(SOA)には、採用した管理策とその適用有無の理由などを記載する。","a":"A","e":"ISO/IEC 27001附属書Aの管理策に対する組織の選択を示す文書です。"},
  {"g":"リスクマネジメント・ISMS","q":"リスク評価は一度実施すれば十分で、組織やシステムの変更の有無にかかわらず再評価は不要である。","a":"B","e":"組織構造・システム構成・脅威状況が変われば見直しが必要です。"},
  
  {"g":"組織的対策","q":"情報セキュリティポリシは、組織としての基本方針を示す最上位文書である。","a":"A","e":"その下に規程・手順などの下位文書がぶら下がる構成が一般的です。"},
  {"g":"組織的対策","q":"情報セキュリティ委員会は、経営層の指示を受け、セキュリティ施策の審議や推進を行う組織である。","a":"A","e":"トップマネジメントと現場の橋渡し役を担います。"},
  {"g":"組織的対策","q":"セキュリティポリシを策定した後は、従業員への周知は各自に任せ、特別な教育は不要である。","a":"B","e":"教育・訓練・テストなどで理解度を高めることが重要です。"},
  {"g":"組織的対策","q":"テレワーク利用時のセキュリティルールも、情報セキュリティポリシや規程の対象とするべきである。","a":"A","e":"在宅勤務時の端末利用やネットワーク接続ルールなどを明文化します。"},
  {"g":"組織的対策","q":"職務分掌は、不正防止や誤りの発見を目的として、重要な処理を一人で完結させないように役割を分ける考え方である。","a":"A","e":"申請・承認・実行を別々の人が担当するなどの仕組みです。"},
  {"g":"組織的対策","q":"権限委譲を行う場合でも、統制する責任は委譲元の管理者に残る。","a":"A","e":"“責任は残したまま、権限と業務を移す”イメージです。"},
  {"g":"組織的対策","q":"シャドーITとは、IT部門が許可していないクラウドサービスやアプリを業務で利用することを指す。","a":"A","e":"利便性は高いですが、情報漏えい等のリスクが増大します。"},
  {"g":"組織的対策","q":"ログ管理は技術的対策であり、組織としての運用ルールや責任分担を決める必要はない。","a":"B","e":"取得範囲・保存期間・閲覧権限・監査方法などを組織として定めます。"},
  {"g":"組織的対策","q":"委託先に業務をアウトソースする場合、自社のセキュリティ要求を契約やSLAに明記することが重要である。","a":"A","e":"セキュリティ要件を契約に織り込むことで、責任範囲を明確化します。"},
  {"g":"組織的対策","q":"セキュリティ教育は、新入社員だけに行えば十分であり、既存社員への定期的な教育は不要である。","a":"B","e":"脅威やルールは変化するため、定期的な教育・訓練が必要です。"},
  {"g":"組織的対策","q":"情報資産台帳の整備は、リスクアセスメントやインシデント対応を行ううえで役立つ。","a":"A","e":"どこに何があるか把握できていることが、対策の前提になります。"},
  {"g":"組織的対策","q":"セキュリティ対策の有効性を確認するために、定期的な自己点検や第三者評価が行われることがある。","a":"A","e":"内部監査や外部監査が代表的です。"},
  
  {"g":"人的セキュリティ","q":"採用時には、入社後に扱う情報の機密性に応じて、誓約書や守秘義務契約を結ぶことがある。","a":"A","e":"退職後も守秘義務が継続する旨を明記する場合もあります。"},
  {"g":"人的セキュリティ","q":"セキュリティインシデントの多くは、人の誤操作やうっかりミスに起因することがある。","a":"A","e":"USBの紛失、誤送信、設定ミスなど人的要因の事例は多いです。"},
  {"g":"人的セキュリティ","q":"内部不正を防止するためには、職務分掌やアクセス制御だけでなく、人事評価や職場環境も重要である。","a":"A","e":"不満やストレスが不正の動機となることもあるためです。"},
  {"g":"人的セキュリティ","q":"退職者のアカウントは、退職後も一定期間はそのままにしておくのが望ましい。","a":"B","e":"退職と同時にID廃止・権限削除などの手続きを行うべきです。"},
  {"g":"人的セキュリティ","q":"ソーシャルエンジニアリングは、人の心理や習慣を悪用して情報を盗み出す攻撃手法である。","a":"A","e":"なりすまし電話やショルダーハッキングなどが例です。"},
  {"g":"人的セキュリティ","q":"パスワードを付箋に書いてモニタに貼ることは、業務効率の観点から推奨される。","a":"B","e":"第三者に見られてしまうため、典型的なNG行為です。"},
  {"g":"人的セキュリティ","q":"従業員向けセキュリティ教育では、実際の事例や身近なケースを紹介すると理解が深まりやすい。","a":"A","e":"“自分ごと”としてイメージしやすくなります。"},
  {"g":"人的セキュリティ","q":"人事異動時には、新しい職務に必要な権限は自動的に追加され、不要な権限は自動的に削除されるため、特に確認は不要である。","a":"B","e":"権限棚卸しやロール見直しで、過剰権限が残らないようにします。"},
  {"g":"人的セキュリティ","q":"テレワーク時に家族や友人に業務内容を詳しく説明することは、情報漏えいの原因となりうる。","a":"A","e":"“口からの漏えい”も人的セキュリティの対象です。"},
  {"g":"人的セキュリティ","q":"セキュリティ意識向上には、罰則だけでなく、わかりやすいルールや相談しやすい風土も重要である。","a":"A","e":"萎縮させるだけでは、インシデントの隠蔽を招くおそれがあります。"},
  
  {"g":"物理・環境セキュリティ","q":"サーバ室への入退室管理は、情報資産への不正物理アクセスを防ぐために重要である。","a":"A","e":"カード認証や生体認証、入退室ログの管理が行われます。"},
  {"g":"物理・環境セキュリティ","q":"クリアデスク・クリアスクリーンは、席を離れるときに机上や画面上の情報を残したままにしないルールである。","a":"A","e":"紙の書類の片付けや、画面ロックを徹底します。"},
  {"g":"物理・環境セキュリティ","q":"コピー機やプリンタの出力物は、印刷した本人が取りに行かなくてもセキュリティ上問題ない。","a":"B","e":"放置された用紙からの情報盗み見・持ち去りのリスクがあります。"},
  {"g":"物理・環境セキュリティ","q":"機密文書を廃棄する際には、シュレッダや溶解処理などにより、復元困難な形で処分することが望ましい。","a":"A","e":"ゴミ箱にそのまま捨てると“ダンプスターダイビング”のリスクがあります。"},
  {"g":"物理・環境セキュリティ","q":"ノートPCの盗難対策として、ワイヤーロックやケーブルロックを活用することがある。","a":"A","e":"物理的に机などに固定し、持ち去りを困難にします。"},
  {"g":"物理・環境セキュリティ","q":"非常時の避難経路や防災対策は、情報セキュリティとは無関係である。","a":"B","e":"人命保護や事業継続は情報セキュリティ（可用性）の観点からも重要です。"},
  {"g":"物理・環境セキュリティ","q":"データセンタでは、耐震構造や二重化電源などが可用性向上のために用いられる。","a":"A","e":"停電や設備故障でもサービスを継続できるよう設計されます。"},
  {"g":"物理・環境セキュリティ","q":"訪問者は、入館時に身分確認や来訪目的の確認を行い、必要に応じて入館証を発行することが望ましい。","a":"A","e":"第三者のなりすまし侵入を防ぐための基本的な管理です。"},
  {"g":"物理・環境セキュリティ","q":"機器や記憶媒体の廃棄時に、データを消去せずそのまま処分しても、情報漏えいの心配はない。","a":"B","e":"復元されるおそれがあるため、上書き消去や物理破壊が必要です。"},
  {"g":"物理・環境セキュリティ","q":"清掃業者や保守業者などの第三者がオフィスに立ち入る場合も、必要に応じて守秘義務契約を結ぶことがある。","a":"A","e":"営業時間外に入室する場合など、情報へのアクセスリスクを考慮します。"},
  
  {"g":"技術的セキュリティ","q":"ファイアウォールは、ネットワークの出入口で通信を制御し、不正なアクセスを防ぐための装置または機能である。","a":"A","e":"IPアドレスやポート番号などの条件でパケットを制御します。"},
  {"g":"技術的セキュリティ","q":"IDS/IPSは、ネットワークやホスト上の不正アクセスや攻撃を検知・防止する仕組みである。","a":"A","e":"IDSは検知、IPSは検知に加えて遮断を行うのが一般的です。"},
  {"g":"技術的セキュリティ","q":"多要素認証では、IDとパスワードだけを使う方式を指す。","a":"B","e":"“知っているもの＋持っているもの＋本人であること”など複数要素を組み合わせます。"},
  {"g":"技術的セキュリティ","q":"VPNは、インターネットなどの共有ネットワーク上に暗号化された仮想的な専用線を構築する技術である。","a":"A","e":"拠点間接続やテレワークでよく利用されます。"},
  {"g":"技術的セキュリティ","q":"WPA3は、Wi-Fi通信の暗号化方式の一つであり、WEPよりも強固なセキュリティを提供する。","a":"A","e":"WEPは古く脆弱なので使用は避けるべきとされています。"},
  {"g":"技術的セキュリティ","q":"メールのなりすまし対策として、SPFやDMARCなどの送信ドメイン認証技術が用いられる。","a":"A","e":"正当な送信元ドメインかどうかを検証します。"},
  {"g":"技術的セキュリティ","q":"HTTPSは、HTTPにTLSなどの暗号化技術を組み合わせて通信の機密性と完全性を高める。","a":"A","e":"ブラウザの“鍵マーク”がHTTPS通信の目印です。"},
  {"g":"技術的セキュリティ","q":"マルウェア対策ソフトは、定義ファイルを更新しなくても常に最新の脅威に対応できる。","a":"B","e":"定義ファイルやパターンの更新、エンジンのアップデートが必要です。"},
  {"g":"技術的セキュリティ","q":"ログの改ざんを防ぐために、ログサーバを分離したり、書き込み専用媒体に保存したりすることがある。","a":"A","e":"攻撃者にログを消されると原因究明が困難になります。"},
  {"g":"技術的セキュリティ","q":"パッチ管理は、OSやソフトウェアの脆弱性を修正する更新を計画的に適用する活動である。","a":"A","e":"大規模なインシデントでは、未適用の脆弱性が突かれる事例が多く報告されています。"},
  
  {"g":"法令・標準","q":"サイバーセキュリティ基本法は、国のサイバーセキュリティ戦略や関係者の責務を定めた法律である。","a":"A","e":"国・地方公共団体・事業者などの役割が示されています。"},
  {"g":"法令・標準","q":"不正アクセス禁止法では、他人のID・パスワードを不正に取得したり、第三者に提供したりする行為も対象となる。","a":"A","e":"アクセス制御を突破する行為だけでなく、助長行為も禁止されています。"},
  {"g":"法令・標準","q":"個人情報保護法の対象となる個人情報には、生存している個人に関する情報が含まれる。","a":"A","e":"原則として亡くなった方に関する情報は対象外です。"},
  {"g":"法令・標準","q":"マイナンバーを含む個人情報は、特定個人情報として厳格な管理が求められる。","a":"A","e":"漏えい時の影響が大きいため、特別な安全管理措置が必要とされています。"},
  {"g":"法令・標準","q":"著作権法では、業務目的であれば、インターネット上の画像や文章を自由にコピーして利用してよい。","a":"B","e":"権利者の許諾なく複製・公衆送信することは原則として認められていません。"},
  {"g":"法令・標準","q":"GDPRは、日本国内の企業には一切関係しない欧州連合(EU)のみの規制である。","a":"B","e":"EU在住者の個人データを扱う日本企業なども対象となる場合があります。"},
  {"g":"法令・標準","q":"JIS Q 15001は、個人情報保護マネジメントシステムに関する日本の規格である。","a":"A","e":"プライバシーマーク制度の審査基準としても利用されています。"},
  {"g":"法令・標準","q":"プライバシーマーク(Pマーク)は、個人情報を適切に取り扱う仕組みを整えた事業者に付与される認証である。","a":"A","e":"一般財団法人日本情報経済社会推進協会(JIPDEC)などが運営しています。"},
  {"g":"法令・標準","q":"情報セキュリティマネジメントシステムの構築において、ISO/IEC 27001シリーズが参照されることが多い。","a":"A","e":"要求事項や管理策のカタログとして利用されます。"},
  {"g":"法令・標準","q":"コンプライアンスとは、法律だけを守ればよく、社内規程や社会的な要請を考慮する必要はないという考え方である。","a":"B","e":"法令・社内規程・社会的規範などを総合的に守る姿勢が求められます。"},
  
  {"g":"インシデント対応・BCP","q":"インシデント対応計画には、検知・報告・初動・分析・復旧・再発防止などの流れを定めることが望ましい。","a":"A","e":"平常時の準備が、非常時の混乱を抑える鍵になります。"},
  {"g":"インシデント対応・BCP","q":"インシデント発生時には、まず証拠保全よりも、必ずシステムをすぐ電源オフにすることが最優先である。","a":"B","e":"状況によっては証拠が失われるため、手順に従った対応が重要です。"},
  {"g":"インシデント対応・BCP","q":"CSIRTは、セキュリティインシデントへの対応や調整を行う専門チームである。","a":"A","e":"社内のインシデントハンドリングの中心的役割を担います。"},
  {"g":"インシデント対応・BCP","q":"インシデント対応訓練は、机上演習だけでなく、実機を用いた技術的な訓練を含めることで効果が高まる。","a":"A","e":"連絡体制・判断プロセス・技術対応を事前に確認できます。"},
  {"g":"インシデント対応・BCP","q":"事業継続計画(BCP)は、自然災害やサイバー攻撃などで事業が中断した場合に、早期復旧を図るための計画である。","a":"A","e":"RTOやRPOなどの目標値を設定しておくことが多いです。"},
  {"g":"インシデント対応・BCP","q":"バックアップは、同一建物内の1か所だけに保存しておけば、災害時にも十分な冗長性が確保できる。","a":"B","e":"地理的に離れた場所への遠隔バックアップが望まれます。"},
  {"g":"インシデント対応・BCP","q":"情報セキュリティ10大脅威では、ランサムウェアやサプライチェーン攻撃などが継続的に上位に挙げられている。","a":"A","e":"近年の一覧を見ると、これらの脅威が常に重要テーマとして扱われています。"},
  {"g":"インシデント対応・BCP","q":"ランサムウェア感染時に、身代金を支払えば必ず元どおりに復旧できるので、支払いが推奨されている。","a":"B","e":"支払っても復旧しない事例もあり、再攻撃や犯罪助長のリスクもあります。"},
  {"g":"インシデント対応・BCP","q":"サプライチェーン攻撃では、自社ではなく、取引先や委託先のセキュリティの弱点が狙われることがある。","a":"A","e":"ソフトウェア更新サーバやクラウド事業者が攻撃経路になる事例もあります。"},
  {"g":"インシデント対応・BCP","q":"インシデントの教訓を次の対策に反映させる“振り返り”は、PDCAサイクルの一部として重要である。","a":"A","e":"発生後レビューを行い、手順や技術対策を改善します。"},

  {"g":"セキュリティ基本","q":"脅威インテリジェンスは、攻撃者の手口や最新の脅威情報を収集・分析することで、組織の防御力を高める取り組みである。","a":"A","e":"攻撃傾向や脆弱性情報を早期に得ることが目的です。"},
  {"g":"セキュリティ基本","q":"スパイウェアは、利用者に知られないように情報を外部へ送信するマルウェアの一種である。","a":"A","e":"キー入力記録や盗み見を行うことがあります。"},
  {"g":"セキュリティ基本","q":"水飲み場攻撃は、特定のターゲットがよく利用するWebサイトを改ざんする攻撃である。","a":"A","e":"正規サイトを装うため、気付きにくい攻撃として知られます。"},
  {"g":"セキュリティ基本","q":"標的型攻撃メールは、必ず大量配信されるため、広い範囲に被害が出る特徴がある。","a":"B","e":"特定組織・個人に絞った少数精鋭の攻撃です。"},
  {"g":"セキュリティ基本","q":"攻撃の初期段階では、偵察行動としてSNSや公開情報の収集が行われることがある。","a":"A","e":"OSINT と呼ばれる合法情報の分析が行われます。"},
  {"g":"セキュリティ基本","q":"脅威アクタとは、一般に脆弱性の存在そのものを指す用語である。","a":"B","e":"脅威アクタは攻撃者（国家・犯罪組織・内部犯行など）を指します。"},
  {"g":"セキュリティ基本","q":"セキュリティバイデザインは、システム開発の後工程でセキュリティをまとめて実装する考え方である。","a":"B","e":"設計段階からセキュリティを組み込む考え方です。"},
  {"g":"セキュリティ基本","q":"ゼロデイ攻撃とは、脆弱性がベンダに公開される前にその脆弱性を悪用する攻撃を指す。","a":"A","e":"ベンダが修正パッチを出す前の危険な状態です。"},
  {"g":"セキュリティ基本","q":"パスワードスプレー攻撃は、1つのアカウントに対し大量のパスワードを総当たりする攻撃である。","a":"B","e":"少数のパスワードを多くのアカウントに試す攻撃手法です。"},
  {"g":"セキュリティ基本","q":"アカウントロックアウトは、攻撃者による総当たり攻撃の抑止に有効である。","a":"A","e":"一定回数の失敗でロックする仕組みです。"},

  {"g":"リスクマネジメント・ISMS","q":"リスク受容は、自組織が許容可能と判断した範囲であれば何も対策せずに放置してよい。","a":"B","e":"受容する理由の記録と経営判断が必要です。"},
  {"g":"リスクマネジメント・ISMS","q":"ISMSにおける文書管理では、版管理や承認の履歴が重要となる。","a":"A","e":"古い版の利用による事故を防ぐためです。"},
  {"g":"リスクマネジメント・ISMS","q":"リスク低減は、脅威を削除することのみを目的とする。","a":"B","e":"脆弱性を改善したり影響を小さくすることも含みます。"},
  {"g":"リスクマネジメント・ISMS","q":"ISMSの運用では、トップマネジメントのコミットメントが不可欠である。","a":"A","e":"経営層の支援がないと全社的取り組みになりません。"},
  {"g":"リスクマネジメント・ISMS","q":"リスク分析では、影響度と発生確率を用いて評価する方法が一般的である。","a":"A","e":"“リスクマトリクス”がよく使われます。"},
  {"g":"リスクマネジメント・ISMS","q":"適用宣言書(SOA)には、採用していない管理策について理由を記載する。","a":"A","e":"“適用しない根拠”が審査で重視されます。"},
  {"g":"リスクマネジメント・ISMS","q":"ISMSでは“継続的改善”が重要であり、定期的な見直しが求められる。","a":"A","e":"PDCA の C/A が重要です。"},
  {"g":"リスクマネジメント・ISMS","q":"残留リスクは対策後に完全にゼロにできるものである。","a":"B","e":"ゼロにすることは現実的ではありません。"},
  {"g":"リスクマネジメント・ISMS","q":"ISMSの内部監査では、監査対象部署の責任者が自分で監査するのが望ましい。","a":"B","e":"利害関係のない者が実施します。"},
  {"g":"リスクマネジメント・ISMS","q":"リスク移転には、損害保険の利用も含まれる。","a":"A","e":"外部へリスクを移す代表例です。"},

  {"g":"組織的対策","q":"情報セキュリティ委員会は、インシデント発生時に対応の指揮をとることが多い。","a":"A","e":"全社的な調整を行います。"},
  {"g":"組織的対策","q":"業務委託先が増えるほど、サプライチェーンリスクは低くなる。","a":"B","e":"委託先の脆弱性が攻撃経路となる可能性が増えます。"},
  {"g":"組織的対策","q":"情報資産管理台帳は、機器やデータの所在や責任者を管理する目的で作成される。","a":"A","e":"リスクアセスメントの前提資料にもなります。"},
  {"g":"組織的対策","q":"セキュリティ啓発では、経営層の定期メッセージが有効である。","a":"A","e":"トップの姿勢が文化に影響します。"},
  {"g":"組織的対策","q":"業務アカウントと個人アカウントを分けて利用することは内部不正対策として有効である。","a":"A","e":"責任の明確化につながります。"},
  {"g":"組織的対策","q":"委託契約時に、再委託の可否や条件を明確にすることはセキュリティ観点で重要である。","a":"A","e":"知らない二次委託がリスクを増大させます。"},
  {"g":"組織的対策","q":"クラウドサービス利用時には、SLAでセキュリティ項目を確認することが望ましい。","a":"A","e":"可用性・バックアップ・暗号化など。"},
  {"g":"組織的対策","q":"ログ管理は、従業員の監視目的で行うものであり、インシデント対応とは無関係である。","a":"B","e":"インシデント原因調査に不可欠です。"},
  {"g":"組織的対策","q":"内部不正対策の一つとして、重要作業時の二人作業（二重チェック）がある。","a":"A","e":"不正抑止や誤り発見に有効です。"},
  {"g":"組織的対策","q":"セキュリティ運用はIT部門だけの責任であり、業務部門は関与する必要はない。","a":"B","e":"業務側の協力が不可欠です。"},

  {"g":"人的セキュリティ","q":"退職時には、貸与物の返却やアカウント削除を確実に行う必要がある。","a":"A","e":"権限が残ると非常に危険です。"},
  {"g":"人的セキュリティ","q":"内部犯行は一般に組織外からの攻撃より早期に発見されやすい。","a":"B","e":"むしろ長期間気付かれにくい傾向があります。"},
  {"g":"人的セキュリティ","q":"パスワードを使い回すことは、アカウント乗っ取りリスクを高める。","a":"A","e":"漏えい時に“連鎖的被害”が出ます。"},
  {"g":"人的セキュリティ","q":"人事部門との連携は、入退職者の権限管理を適切に行うために不可欠である。","a":"A","e":"人事の動きと権限付与/削除はリンクすべきです。"},
  {"g":"人的セキュリティ","q":"従業員が業務アプリのIDとパスワードを家族に共有することは認められる。","a":"B","e":"重大な禁止事項です。"},
  {"g":"人的セキュリティ","q":"誤送信防止として、メール送信前に一定時間“送信保留”する仕組みがある。","a":"A","e":"最近の対策として普及しています。"},
  {"g":"人的セキュリティ","q":"セキュリティ意識向上には、懲罰的な指導だけが最も効果的である。","a":"B","e":"相談しやすい風土が重要です。"},
  {"g":"人的セキュリティ","q":"なりすまし電話で情報を聞き出す攻撃はソーシャルエンジニアリングに分類される。","a":"A","e":"心理的な弱点を突く攻撃です。"},
  {"g":"人的セキュリティ","q":"内部不正の防止には、ローテーション（職務を定期的に入れ替える）が有効な場合がある。","a":"A","e":"長期同一担当による不正の温床を防ぎます。"},
  {"g":"人的セキュリティ","q":"長時間残業の多い部署は、セキュリティインシデント発生率が低くなる傾向がある。","a":"B","e":"疲労は誤操作リスクを増やします。"},

  {"g":"物理・環境セキュリティ","q":"来客用Wi-Fiは、社内ネットワークとは分離されたネットワークで運用することが望ましい。","a":"A","e":"内部ネットワーク保護のために必要です。"},
  {"g":"物理・環境セキュリティ","q":"サーバ室の入退室ログは、定期的に確認すると不正侵入の早期発見に役立つ。","a":"A","e":"記録の確認は有効です。"},
  {"g":"物理・環境セキュリティ","q":"監視カメラの映像は、保全せずに即時削除しても問題ない。","a":"B","e":"一定期間は証跡として保存します。"},
  {"g":"物理・環境セキュリティ","q":"紙文書の持ち出しルールも情報セキュリティの管理対象である。","a":"A","e":"紙媒体も重要資産です。"},
  {"g":"物理・環境セキュリティ","q":"PCの画面をのぞき見されるリスクは、テレワークでは特に高まることがある。","a":"A","e":"カフェ・自宅・交通機関など。"},
  {"g":"物理・環境セキュリティ","q":"災害対策として耐火金庫を利用することは、機密文書保護として有効である。","a":"A","e":"火災・浸水等の対策。"},
  {"g":"物理・環境セキュリティ","q":"重要装置を窓際に配置すると、物理盗難リスクが低下する。","a":"B","e":"むしろ外部侵入のリスクが増えます。"},
  {"g":"物理・環境セキュリティ","q":"サーバやストレージの廃棄時には、物理破壊が推奨されることがある。","a":"A","e":"データ復元されないようにします。"},
  {"g":"物理・環境セキュリティ","q":"プリンタのメモリに印刷履歴が残る場合があり、廃棄時に注意が必要である。","a":"A","e":"ストレージ搭載機もあります。"},
  {"g":"物理・環境セキュリティ","q":"オフィスの無施錠は、外部からの侵入より内部犯行に対してのみ問題になる。","a":"B","e":"外部不審者の侵入リスクもあります。"},

  {"g":"技術的セキュリティ","q":"多要素認証を導入すると、パスワード漏えい時の影響を軽減できる。","a":"A","e":"アカウント乗っ取りの防止に有効です。"},
  {"g":"技術的セキュリティ","q":"ブルートフォース攻撃は、すべての可能な組合せを試す攻撃手法である。","a":"A","e":"総当たり攻撃とも呼ばれます。"},
  {"g":"技術的セキュリティ","q":"暗号化通信を使うと、必ず通信内容の改ざんを検出できる。","a":"B","e":"方式に依存し、設定ミスなどもあり得ます。"},
  {"g":"技術的セキュリティ","q":"不正端末接続を防ぐ仕組みとして、ネットワークアクセス制御(NAC)がある。","a":"A","e":"認証されていない端末の接続を拒否します。"},
  {"g":"技術的セキュリティ","q":"脆弱性スキャンは、システムの弱点を自動的に検出する手法である。","a":"A","e":"定期実施が推奨されています。"},
  {"g":"技術的セキュリティ","q":"OSやアプリのアップデートは、セキュリティ対策としてそれほど重要ではない。","a":"B","e":"更新放置が重大インシデントの原因になります。"},
  {"g":"技術的セキュリティ","q":"暗号化キーの管理は、暗号化の安全性を左右する重要な要素である。","a":"A","e":"鍵が漏れると暗号の意味がありません。"},
  {"g":"技術的セキュリティ","q":"攻撃者は、正規ソフトウェア更新機能を悪用してマルウェアを配布することがある。","a":"A","e":"サプライチェーン攻撃の例です。"},
  {"g":"技術的セキュリティ","q":"DMARCは、Webの暗号化技術であり、ブラウジングの安全性を高める。","a":"B","e":"DMARCはメールのなりすまし対策です。"},
  {"g":"技術的セキュリティ","q":"ゼロトラストモデルでは、ユーザ・端末・アプリの各状態を常に検証し続ける。","a":"A","e":"“常時検証”が特徴です。"},

  {"g":"法令・標準","q":"個人情報保護法では、本人の同意なく目的外利用を行うことは原則禁止されている。","a":"A","e":"利用目的の明確化と遵守が求められます。"},
  {"g":"法令・標準","q":"不正競争防止法では、営業秘密を不正に取得する行為が禁止されている。","a":"A","e":"秘密管理性・有用性・非公知性が要件です。"},
  {"g":"法令・標準","q":"著作権法では、私的利用目的でもネット上の有料動画をダウンロード保存してよい。","a":"B","e":"技術的保護手段を回避する行為は違法です。"},
  {"g":"法令・標準","q":"電気通信事業法では、通信の秘密が保護される。","a":"A","e":"通信内容を勝手に閲覧することはできません。"},
  {"g":"法令・標準","q":"JIS Q 27002は管理策のカタログであり、ISO/IEC 27001の要求事項ではない。","a":"A","e":"27002はガイドライン的文書です。"},
  {"g":"法令・標準","q":"GDPRでは、EU域外の組織は対象になりえない。","a":"B","e":"EU在住者のデータを扱えば対象になり得ます。"},
  {"g":"法令・標準","q":"個人データの漏えい事故があった場合は、一定の場合に主務大臣への報告が必要となる。","a":"A","e":"法改正により報告義務が拡大しました。"},
  {"g":"法令・標準","q":"サイバーセキュリティ基本法では、国・事業者・国民それぞれの責務が示されている。","a":"A","e":"日本の基本方針を定めた法律です。"},
  {"g":"法令・標準","q":"契約書にセキュリティ条項を記載することは、法令遵守とは関係ないため不要である。","a":"B","e":"委託先との合意事項として重要です。"},
  {"g":"法令・標準","q":"プライバシーマークを取得している企業は、個人情報を一切漏えいすることがない。","a":"B","e":"“漏えいゼロ”を保証する制度ではありません。"},

  {"g":"インシデント対応・BCP","q":"インシデント対応では、初動での事実確認が非常に重要である。","a":"A","e":"誤判断による二次被害を防ぎます。"},
  {"g":"インシデント対応・BCP","q":"BCPは情報システムのみを対象として策定する。","a":"B","e":"人・設備・業務プロセス全体を対象とします。"},
  {"g":"インシデント対応・BCP","q":"バックアップの世代管理は、ランサムウェア対策としても有効である。","a":"A","e":"感染後の安全な復元に必要です。"},
  {"g":"インシデント対応・BCP","q":"災害時には、事業継続に不要なシステムを優先的に復旧するのが一般的である。","a":"B","e":"優先度に基づいて復旧します。"},
  {"g":"インシデント対応・BCP","q":"RTOは“目標復旧時間”を指す。","a":"A","e":"どのくらいの時間で復旧させるかの目標。"},
  {"g":"インシデント対応・BCP","q":"CSIRTは、インシデントの再発防止策を検討する役割も担う。","a":"A","e":"対応だけでなく改善も行います。"},
  {"g":"インシデント対応・BCP","q":"インシデント後は、報告書を作成して振り返りを行うことが望ましい。","a":"A","e":"改善活動のための重要プロセスです。"},
  {"g":"インシデント対応・BCP","q":"ログが改ざんされている場合、原因分析が容易になる。","a":"B","e":"むしろ困難になります。"},
  {"g":"インシデント対応・BCP","q":"代替サイトとして“ホットサイト”は、即時復旧が可能なサイトである。","a":"A","e":"常時稼働が前提です。"},
  {"g":"インシデント対応・BCP","q":"インシデントは、実被害が出たものだけを対象とする。","a":"B","e":"未遂や兆候も含まれます。"},

  {"g":"科目B","q":"自社のWebサーバに対して海外から大量のアクセスが急増した。サービスはまだ停止していない。まず取るべき対応として適切なのはどれか？ A：直ちにサーバを停止する B：アクセスログの確認と原因の切り分け","a":"B","e":"停止は最終判断です。まず事実確認と影響の把握が必要です。"},
  {"g":"科目B","q":"社員がフィッシングメールのリンクをクリックしたが、IDとパスワードは入力していないと申告した。適切な対応はどれか？ A：何もしない B：PCのスキャンやログ確認など影響調査を行う","a":"B","e":"リンク先でマルウェア配布の可能性があるため確認が必要です。"},
  {"g":"科目B","q":"委託先が個人情報を誤って外部にメール送信した。まず確認すべき事項はどれか？ A：委託契約のセキュリティ条項 B：送信先の相手が誰で、回収可能かどうか","a":"B","e":"二次被害防止のため“事実と影響”の確認が最優先です。"},
  {"g":"科目B","q":"社内ネットワークで不審な端末が接続されているログを検知した。優先すべき対応はどれか？ A：全ネットワークを遮断する B：問題端末の特定と隔離","a":"B","e":"全遮断は業務影響が大きく、まずは端末隔離が基本です。"},
  {"g":"科目B","q":"クラウドストレージで誤って社外共有設定となっていた。まず実施すべきことはどれか？ A：共有設定を即時解除し、アクセス範囲を確認する B：社外に謝罪文を送る","a":"A","e":"公開状態の継続が最大リスクなので、まず遮断です。"},
  {"g":"科目B","q":"ランサムウェア感染が疑われるPCを発見した。最初の対応として適切なのはどれか？ A：LANケーブルを抜いて隔離する B：電源を切る","a":"A","e":"電源OFFは証拠消失の可能性。まずネットワーク隔離です。"},
  {"g":"科目B","q":"多要素認証が未導入の部署でアカウント乗っ取りが疑われる。優先すべき対応はどれか？ A：全社員へ即時パスワード変更を要求 B：対象アカウントの強制ロックとログ分析","a":"B","e":"まず不正アクセスの有無を確認し、被害拡大を防ぎます。"},
  {"g":"科目B","q":"社員がUSBメモリを紛失した。暗号化はされていない。適切な対応はどれか？ A：警察へ届け出る前に、保存されていたデータ内容の把握 B：紛失の事実だけを記録して終了","a":"A","e":"漏えい対象の把握が重要です。"},
  {"g":"科目B","q":"外部ベンダから提供された更新ファイルの真偽が疑わしい。適切な対応は？ A：すぐ適用する B：提供元への確認とハッシュ値などの検証","a":"B","e":"サプライチェーン攻撃の可能性があります。"},
  {"g":"科目B","q":"社員が不審なポップアップにより偽サポートに電話し、遠隔操作ソフトをインストールしてしまった。まず取るべき対応は？ A：端末のネットワーク隔離 B：社員本人へ注意のみ行う","a":"A","e":"遠隔操作経由の不正アクセスを防ぐ必要があります。"},

  {"g":"科目B","q":"ある部署でログイン失敗が深夜に多数発生。まず必要な確認はどれか？ A：対象アカウントの使用者へ状況確認 B：ネットワーク全停止","a":"A","e":"正規利用か不正かの切り分けが優先です。"},
  {"g":"科目B","q":"取引先から『自社のメールが改ざんされている』と通報があった。最初に実施すべきことは？ A：メールサーバ停止 B：送信ログの確認と事実関係の把握","a":"B","e":"停止前にログ調査が必要です。"},
  {"g":"科目B","q":"社員が誤って社内資料をSNSに投稿した。まず行うべきことは？ A：投稿削除依頼と拡散状況の確認 B：投稿者を即時懲戒処分にする","a":"A","e":"被害拡大防止が最優先です。"},
  {"g":"科目B","q":"老朽化したサーバで障害が頻発。セキュリティ観点で重要な考え方は？ A：継続利用し、都度再起動 B：更改計画を立て、早期移行を検討","a":"B","e":"障害は攻撃と誤認しやすく、可用性リスクが高まります。"},
  {"g":"科目B","q":"委託先が外注先をさらに第三者へ再委託していたことが判明。適切な対応は？ A：再委託の契約内容やセキュリティ水準の確認 B：即時契約解除","a":"A","e":"再委託管理はサプライチェーンリスク管理の重要項目です。"},
  {"g":"科目B","q":"テレワーク社員のPCが家族の利用により設定が変更された可能性がある。まず確認すべきは？ A：業務データの持ち出しの有無 B：家族への注意喚起のみ","a":"A","e":"情報漏えいの有無が重要です。"},
  {"g":"科目B","q":"アプリケーションの脆弱性が“高リスク”と判定されたが、外部公開していない内部システムである。適切な判断は？ A：即時停止 B：影響範囲と攻撃経路を確認し、優先度評価","a":"B","e":"脆弱性のリスクは環境によって異なります。"},
  {"g":"科目B","q":"社内ネットワークで通信量が急増したため調査したところ、特定端末が大量送信していた。考えられる最初の対応は？ A：端末隔離 B：社員への一斉注意喚起のみ","a":"A","e":"マルウェア感染の可能性が高いです。"},
  {"g":"科目B","q":"重要顧客データを保存したファイルが暗号化されアクセス不能になった。ランサムウェアが疑われる。最初に行うべきことは？ A：ネットワーク隔離 B：身代金交渉開始","a":"A","e":"感染拡大を防ぐことが最優先です。"},
  {"g":"科目B","q":"新規システム導入の要件定義でセキュリティ要件が全く記載されていなかった。最適な行動は？ A：開発後にまとめて考える B：要件定義段階でセキュリティ要件を追加","a":"B","e":"セキュリティバイデザインが重要です。"},

  {"g":"科目B","q":"新入社員向けにセキュリティ教育を行うことになった。限られた時間で最も優先すべき内容として適切なのはどれか？ A：最新の暗号アルゴリズムの数式の詳細説明 B：パスワード管理やフィッシングメール対策など日常業務に直結する内容","a":"B","e":"まず日常業務での具体的な行動に直結する内容を理解してもらうことが重要です。"},
  {"g":"科目B","q":"クラウドサービスを導入するにあたり、セキュリティ担当者がまず確認すべき点として適切なのはどれか？ A：クラウド事業者の企業ロゴやイメージ B：データ保管場所や暗号化、認証方式などのセキュリティ要件","a":"B","e":"技術的・物理的なセキュリティ対策が自社の要求レベルを満たすかどうかが重要です。"},
  {"g":"科目B","q":"営業担当者が、取引先の会議室で自社のノートPCを無人のまま机に置いて長時間離席していた。セキュリティ上、まず指導すべき点はどれか？ A：社外では必ずPCを携帯するか施錠できる場所に保管する B：会議室なら社外でも特に問題ないと伝える","a":"A","e":"盗難・不正利用・情報のぞき見のリスクがあるため、物理的な管理を徹底する必要があります。"},
  {"g":"科目B","q":"社内の一部部署でだけ多要素認証が導入されていないことが判明した。セキュリティ担当者の対応として適切なのはどれか？ A：すぐにその部署の業務を停止する B：その部署の業務影響とリスクを評価し、早期導入計画を策定する","a":"B","e":"業務継続とのバランスを取りながらリスクを評価し、優先度を付けて導入することが重要です。"},
  {"g":"科目B","q":"あるWebサービスでパスワードリスト攻撃による不正ログインが疑われている。初動として適切なのはどれか？ A：全ユーザに強制的にアカウント削除をさせる B：該当IPアドレスや異常な試行パターンをログから特定し、遮断やロックアウト条件を見直す","a":"B","e":"攻撃元とパターンの把握、そして技術的な防御強化が初動として重要です。"},
  {"g":"科目B","q":"営業担当が、個人のクラウドストレージに業務データを保存していたことが発覚した。まず取るべき対応として適切なのはどれか？ A：個人クラウドの利用状況と保存データを確認し、必要に応じて削除や移行を行う B：本人を即日懲戒解雇とし、それ以上の調査は行わない","a":"A","e":"まずリスクの把握と被害範囲の確認が重要であり、そのうえでルール整備や教育を行います。"},
  {"g":"科目B","q":"テレワーク中の社員から、自宅Wi-Fiの暗号化方式が古いかもしれないと相談があった。セキュリティ担当の助言として適切なのはどれか？ A：暗号化なしで使っても回線契約者が本人なら問題ない B：WPA2以上の方式を利用し、初期パスワードから十分強度のあるパスフレーズに変更するよう助言する","a":"B","e":"暗号化方式の更新と強固なパスフレーズ設定は、家庭環境でも基本的な対策です。"},
  {"g":"科目B","q":"開発部門が、テスト用に本番と同じ個人情報データをコピーして利用しようとしている。セキュリティマネジメントとして適切な対応はどれか？ A：テスト効率を優先し、そのまま利用を認める B：匿名化・マスキングなどを施したテストデータを利用するよう求める","a":"B","e":"テスト環境での本番個人情報利用は漏えいリスクが高いため、原則避けるべきです。"},
  {"g":"科目B","q":"社内アンケートで、従業員の多くが「セキュリティ方針をよく知らない」と回答した。最も優先して行うべきことはどれか？ A：セキュリティ方針の要点を分かりやすくまとめ、説明会やeラーニングで周知する B：社員には難しすぎるため、方針文書の公開をやめる","a":"A","e":"方針は分かりやすく伝え、行動規範として浸透させることが重要です。"},
  {"g":"科目B","q":"ある業務システムに高リスクの脆弱性が見つかったが、直ちに修正すると重要な繁忙期の業務に影響が出る可能性がある。セキュリティ担当者の対応として妥当なのはどれか？ A：業務影響を無視して即時停止と修正を行う B：リスクと業務影響を関係者と共有し、一時的な代替策や運用でリスクを抑えつつ、最短で修正タイミングを決定する","a":"B","e":"リスクと事業継続性のバランスをとりながら、合意に基づく判断を行うことが重要です。"},
  {"g":"科目B","q":"インシデント対応訓練を行う目的として最も適切なのはどれか？ A：報告書の形式に慣れるため B：実際のインシデント発生時に、役割分担や手順どおりに動けるか確認・改善するため","a":"B","e":"訓練は、現実に即した対応能力の向上と問題点の洗い出しのために実施します。"},
  {"g":"科目B","q":"社内からの発信メールにDMARC等の送信ドメイン認証を導入した主な目的として適切なのはどれか？ A：メール本文の文字化けを防ぐため B：自社ドメインを装ったフィッシングメールなどのなりすましメールを検出・拒否しやすくするため","a":"B","e":"送信元ドメインの正当性を検証し、なりすまし対策に役立ちます。"},
  {"g":"科目B","q":"災害対策の見直しで、データセンタと同じ地域にバックアップサイトを置いていたことが判明した。改善策として適切なのはどれか？ A：同じ建物内にさらにバックアップサーバを増設する B：別地域のデータセンタ等、広域災害の影響を分散できる場所にバックアップサイトを設ける","a":"B","e":"広域災害を想定し、物理的に離れた拠点を用意することが望まれます。"},
  {"g":"科目B","q":"外部委託先に定期的なセキュリティ監査を実施したところ、軽微だが改善すべき点がいくつか見つかった。適切な対応はどれか？ A：指摘事項を文書化し、改善計画と期限の提出を求める B：軽微なので、次回の監査まで特に何もしない","a":"A","e":"継続的改善の観点から、軽微な点も計画的に是正していくことが重要です。"},
  {"g":"科目B","q":"社員が在宅勤務中に、自宅の私物PCで社内システムにアクセスしたいと申し出た。セキュリティ担当の対応として適切なのはどれか？ A：業務効率を優先して許可する B：社内で許可された端末のみアクセス可能とするルールを説明し、必要なら会社貸与端末を用意する","a":"B","e":"管理できない私物端末は、マルウェア感染や設定不備などのリスクが高く、原則禁止が望まれます。"},
  {"g":"科目B","q":"定期的なログレビューを行ったところ、ある一般ユーザアカウントで深夜時間帯のアクセスが継続的に見られた。最初に行うべきことはどれか？ A：すぐにそのアカウントを削除する B：該当ユーザに利用実態を確認し、正当な利用かどうかを確かめる","a":"B","e":"まず正当利用かどうかの事実確認を行い、その結果に応じて対策を検討します。"},
  {"g":"科目B","q":"標的型メール訓練の結果、多くの社員が模擬フィッシングメールのリンクをクリックしてしまった。次の施策として適切なのはどれか？ A：失敗した社員だけを厳しく叱責する B：失敗事例を匿名化して共有し、メールの見分け方や申告手順を再教育する","a":"B","e":"失敗から学べるような風土づくりと、全体のリテラシ向上が重要です。"},
  {"g":"科目B","q":"社内システムへのアクセス権限が、退職者のアカウントに残っていたことが監査で判明した。最も重要な改善策はどれか？ A：監査で見つかったので、今回は特に何もしない B：人事手続きと連動したアカウント無効化プロセスを整備し、定期的な権限棚卸しを行う","a":"B","e":"退職者・異動者の権限管理は内部不正防止の要であり、プロセスと定期チェックの整備が重要です。"},
  {"g":"科目B","q":"インシデント対応でCSIRTが外部機関に相談する主な目的として適切なのはどれか？ A：社内の責任を外部機関に転嫁するため B：技術的知見や最新の攻撃情報、対応事例を得て適切な対策に役立てるため","a":"B","e":"専門機関の知見を活用し、より適切な判断・対応につなげることが目的です。"},
  {"g":"科目B","q":"業務アプリの重大な脆弱性について開発ベンダから情報提供があったが、自社内ではまだ悪用事例は確認されていない。この段階で適切な対応はどれか？ A：発生していないので様子見とする B：脆弱性の内容と影響範囲を確認し、パッチ適用や暫定対策の計画を立てる","a":"B","e":"悪用事例の有無にかかわらず、脆弱性情報を受け取った時点で対応方針を検討する必要があります。"},
  {"g":"科目B","q":"メールで届いた取引先からの請求書PDFが怪しいと感じた社員が、セキュリティ窓口に相談してきた。この状況で最も望ましい対応はどれか？ A：社員を臆病だと注意し、自己判断を促す B：相談してくれたことを評価し、添付ファイルを安全な検査環境で確認する","a":"B","e":"怪しいと感じた時に相談できる文化を作ることは、早期検知にとても有効です。"},
  {"g":"科目B","q":"新たな業務システム導入プロジェクトで、要件定義書にセキュリティ要件がほとんど記載されていない。セキュリティ担当として適切な行動はどれか？ A：開発が進んでから必要な対策を付け足す B：プロジェクト初期段階でセキュリティ要件レビューの場を設け、必要事項を洗い出す","a":"B","e":"セキュリティは初期段階から組み込むことで、コストや手戻りを抑えつつ適切な対策が可能になります。"},
  {"g":"科目B","q":"社内の古いファイルサーバが長年整理されておらず、アクセス権も緩く設定されている。最初に行うべき対応として適切なのはどれか？ A：サーバを突然停止して利用を禁止する B：保管データの種別や重要度を把握し、アクセス権限の見直しと不要データの削除を進める","a":"B","e":"現状把握と整理を行いながら、権限の最小化と情報資産の棚卸しを行うことが重要です。"},
  {"g":"科目B","q":"社外からのVPN接続ログを確認したところ、通常の業務時間帯とは異なる深夜に海外IPからの接続が見つかった。適切な対応はどれか？ A：直ちにVPNサービスを廃止する B：該当アカウントと接続元情報を確認し、正当性の有無を調査したうえで必要に応じて制限や多要素認証を強化する","a":"B","e":"正当利用かどうかを確認しつつ、不審なアクセスを防ぐための制御強化を検討します。"},
  {"g":"科目B","q":"セキュリティポリシを改定したが、社員からは読みづらい・長すぎるという声が多い。改善策として最も効果的なのはどれか？ A：ポリシ本文はそのままにし、要点をまとめた簡易版や図解資料を作成する B：社員が読まないのでポリシの公開をやめる","a":"A","e":"正式文書と併せて、現場が理解しやすい形で伝える工夫が重要です。"},
  {"g":"科目B","q":"重要システムのバックアップは取得しているが、復元テストは長年実施していない。セキュリティマネジメントとして適切な対応はどれか？ A：バックアップがあるので特に問題ない B：定期的な復元テストを計画・実施し、復旧手順や所要時間を確認する","a":"B","e":"バックアップは復元できて初めて意味があり、定期的なテストが不可欠です。"},
  {"g":"科目B","q":"社内にセキュリティ関連の問い合わせ窓口を設けたが、相談がほとんど寄せられない。改善策として適切なのはどれか？ A：窓口を廃止する B：匿名相談の受付や、相談事例の共有など、利用しやすい仕組みや雰囲気づくりを行う","a":"B","e":"相談しづらい雰囲気を解消し、気軽に相談できる文化を作ることが重要です。"},
  {"g":"科目B","q":"テレワーク用に持ち出されたノートPCが盗難に遭ったが、ディスクはフル暗号化されており、ログインパスワードも強固であった。この場合の適切な評価はどれか？ A：暗号化されているため、個人情報漏えいリスクは大幅に低減されている B：暗号化されていても、必ずすべての情報が漏えいすると考えるべきである","a":"A","e":"暗号化と適切な認証によりリスクは大きく低減されますが、念のための報告・評価・再発防止も必要です。"},


  {"g":"基本用語","q":"情報セキュリティの3要素は機密性・完全性・可用性である。","a":"A","e":"CIAの3要素。"},
  {"g":"基本用語","q":"機密性は“正しい状態を維持すること”を指す。","a":"B","e":"正しい状態維持は完全性。機密性は秘匿。"},
  {"g":"基本用語","q":"完全性は改ざんされていない状態を確保することである。","a":"A","e":"正確さ・完全さの維持。"},
  {"g":"基本用語","q":"可用性は必要なときに利用できる状態を保つことである。","a":"A","e":"システム停止を防ぎます。"},
  {"g":"基本用語","q":"真正性は通信相手が本物であることを保証する性質である。","a":"A","e":"本人性の証明に関係。"},

  {"g":"基本用語","q":"責任追跡性は行動を後から確認できる能力を指す。","a":"A","e":"ログ管理などで実現。"},
  {"g":"基本用語","q":"否認防止は“やっていない”と言わせない仕組みである。","a":"A","e":"電子署名などが利用されます。"},
  {"g":"基本用語","q":"信頼性は障害が起こっても短時間で復旧する性質である。","a":"B","e":"短時間復旧は保守性。信頼性は故障しにくさ。"},
  {"g":"基本用語","q":"脅威は情報資産に損害を与える潜在的な要因である。","a":"A","e":"自然災害・攻撃者・設定ミスなど。"},
  {"g":"基本用語","q":"脆弱性は資産やシステムの弱点を意味する。","a":"A","e":"攻撃される入口となる。"},

  {"g":"リスク","q":"リスクは“脅威 × 脆弱性 × 影響”で考えられる。","a":"A","e":"基本的な計算モデルです。"},
  {"g":"リスク","q":"リスク対応に回避・低減・移転・受容がある。","a":"A","e":"4つの基本方針。"},
  {"g":"リスク","q":"リスク移転はリスクを他社に押し付ける不適切な行為である。","a":"B","e":"保険やアウトソースで適切に行う行為。"},
  {"g":"リスク","q":"リスク受容は影響が小さい場合にそのまま受け入れる方針である。","a":"A","e":"費用対効果がポイント。"},
  {"g":"リスク","q":"リスク分析では資産の価値を考える必要がない。","a":"B","e":"価値が高いほど優先度が高い。"},

  {"g":"マルウェア","q":"ウイルスは単独で自己増殖できるプログラムである。","a":"B","e":"単独で増えるのはワーム。"},
  {"g":"マルウェア","q":"トロイの木馬は有用ソフトに見せかけて侵入する。","a":"A","e":"ユーザの誤認を誘う。"},
  {"g":"マルウェア","q":"ランサムウェアはデータを暗号化し金銭要求する攻撃である。","a":"A","e":"昨今多発する攻撃。"},
  {"g":"マルウェア","q":"スパイウェアは利用者の情報を密かに外部へ送信する。","a":"A","e":"キーロガーなどが代表。"},
  {"g":"マルウェア","q":"ボットは攻撃者に遠隔操作される感染端末である。","a":"A","e":"DDos攻撃の踏み台に利用される。"},

  {"g":"ネットワーク","q":"ファイアウォールは外部からの通信をすべて遮断する装置である。","a":"B","e":"許可・拒否のルールにより制御。"},
  {"g":"ネットワーク","q":"IDSは不正侵入を検知し、自動的に遮断まで行う。","a":"B","e":"遮断まで行うのはIPS。"},
  {"g":"ネットワーク","q":"IPSは不正行為を遮断する機能を持つ。","a":"A","e":"Intrusion Prevention System。"},
  {"g":"ネットワーク","q":"DMZは外部公開サーバを配置するネットワーク領域である。","a":"A","e":"内部との境界に設置。"},
  {"g":"ネットワーク","q":"プロキシサーバは内部端末の代わりに外部へ通信する。","a":"A","e":"キャッシュ・フィルタ機能もあり。"},

  {"g":"ネットワーク","q":"DNSキャッシュポイズニングは名前解決結果を書き換える攻撃である。","a":"A","e":"偽サイトへ誘導する攻撃。"},
  {"g":"ネットワーク","q":"IPスプーフィングはIPアドレスを偽装して攻撃する手法。","a":"A","e":"送信元を偽装する。"},
  {"g":"ネットワーク","q":"MACアドレスフィルタリングは完全なセキュリティ対策である。","a":"B","e":"MACアドレスは偽装できるため不十分。"},
  {"g":"ネットワーク","q":"VPNは暗号化により安全にリモート接続できる技術である。","a":"A","e":"テレワークで利用される。"},
  {"g":"ネットワーク","q":"HTTPSはHTTPに比べて暗号化と認証を提供する。","a":"A","e":"TLSを利用する。"},

  {"g":"暗号","q":"共通鍵暗号方式では暗号化と復号に同じ鍵を使う。","a":"A","e":"シンプルで高速。"},
  {"g":"暗号","q":"公開鍵暗号方式は高速で大量データの暗号化に向いている。","a":"B","e":"共通鍵の方が高速。"},
  {"g":"暗号","q":"ハイブリッド暗号方式は両方式を組み合わせたものである。","a":"A","e":"HTTPSで利用。"},
  {"g":"暗号","q":"ハッシュ関数は復号可能な一方向暗号である。","a":"B","e":"ハッシュは復号不可能な一方向関数。"},
  {"g":"暗号","q":"電子署名は改ざん検出と本人性の証明を提供する。","a":"A","e":"完全性と認証を担保。"},

  {"g":"管理・運用","q":"アクセス制御にはMAC・DAC・RBACなどがある。","a":"A","e":"権限管理の方式。"},
  {"g":"管理・運用","q":"最低権限の原則は必要以上の権限を付与しない考え方である。","a":"A","e":"重要な基本原則。"},
  {"g":"管理・運用","q":"アカウントロックは一定回数ログインに失敗すると利用停止する機能である。","a":"A","e":"ブルートフォース対策。"},
  {"g":"管理・運用","q":"多要素認証では“知識・所有・生体”のうち2要素以上を使う。","a":"A","e":"セキュリティ向上に有効。"},
  {"g":"管理・運用","q":"シングルサインオンは一度認証すると他システムも利用可能となる。","a":"A","e":"ID基盤で利用。"},

  {"g":"管理・運用","q":"ログ管理はインシデント発生時の追跡調査にも役立つ。","a":"A","e":"責任追跡性を支える。"},
  {"g":"管理・運用","q":"パッチ適用はセキュリティ強化のため不要である。","a":"B","e":"脆弱性修正で最重要。"},
  {"g":"管理・運用","q":"バックアップにはフル・差分・増分の種類がある。","a":"A","e":"目的で使い分ける。"},
  {"g":"管理・運用","q":"クライアント証明書はユーザ端末を認証する仕組みである。","a":"A","e":"端末のなりすましを防ぐ。"},
  {"g":"管理・運用","q":"DRサイトは災害時の緊急用サイトである。","a":"A","e":"事業継続計画(BCP)の一つ。"},


  {"g":"インシデント対応","q":"インシデントは情報セキュリティ上の問題が“実際に起きた事象”を指す。","a":"A","e":"事故・攻撃・障害など実際の事象。"},
  {"g":"インシデント対応","q":"インシデント対応では、まず原因究明より影響範囲の特定と初動対応が優先される。","a":"A","e":"被害拡大防止が最優先。"},
  {"g":"インシデント対応","q":"CSIRTは組織内のインシデント対応を統括するチームである。","a":"A","e":"Computer Security Incident Response Team。"},
  {"g":"インシデント対応","q":"初動対応で証拠保全を行う際は、ログを削除して空き容量を確保する必要がある。","a":"B","e":"ログ削除は証拠喪失となり厳禁。"},
  {"g":"インシデント対応","q":"インシデント対応手順は平常時に文書化しておく必要がある。","a":"A","e":"準備が迅速対応の鍵。"},

  {"g":"インシデント対応","q":"ログのタイムスタンプが正しいかは調査において重要である。","a":"A","e":"時系列分析の基礎になる。"},
  {"g":"インシデント対応","q":"感染端末は必ず直ちにネットワークから隔離する。","a":"A","e":"拡散防止が重要。"},
  {"g":"インシデント対応","q":"バックアップからの復旧はインシデント対応の一部に含まれる場合がある。","a":"A","e":"復旧フェーズで使用。"},
  {"g":"インシデント対応","q":"インシデントは攻撃でなければ発生とはみなされない。","a":"B","e":"誤操作や障害もインシデント。"},
  {"g":"インシデント対応","q":"フォレンジック調査ではできるだけ元データを直接改変して調査する。","a":"B","e":"複製を作り、原本は保全するのが原則。"},

  {"g":"法律・規格","q":"個人情報保護法では要配慮個人情報という区分がある。","a":"A","e":"人種・医療情報など。"},
  {"g":"法律・規格","q":"要配慮個人情報は本人同意なく取得してもよい。","a":"B","e":"原則として同意が必要。"},
  {"g":"法律・規格","q":"マイナンバー法は番号の安全管理措置を事業者に義務付けている。","a":"A","e":"取扱いは厳格に規定されている。"},
  {"g":"法律・規格","q":"不正アクセス禁止法は、他人のIDやパスワードで本人同意があればログインしてよい。","a":"B","e":"他人の認証情報利用は同意の有無にかかわらず禁止。"},
  {"g":"法律・規格","q":"著作権法においてプログラムも著作物に含まれる。","a":"A","e":"創作性があれば保護対象。"},

  {"g":"法律・規格","q":"ISMSはISO/IEC 27001に基づく情報セキュリティマネジメントの仕組みである。","a":"A","e":"管理策がまとめられている。"},
  {"g":"法律・規格","q":"ISMSではリスクアセスメントが不要である。","a":"B","e":"最も重要な工程の一つ。"},
  {"g":"法律・規格","q":"ISMS認証を受けると情報漏えい事故が完全になくなる。","a":"B","e":"事故ゼロ保証ではなく管理体制の認証。"},
  {"g":"法律・規格","q":"サイバーセキュリティ経営ガイドラインは経営者向けの文書である。","a":"A","e":"経営者が最低限理解すべき項目を示す。"},
  {"g":"法律・規格","q":"電気通信事業法では通信の秘密が保護されている。","a":"A","e":"通信内容の守秘義務。"},

  {"g":"物理セキュリティ","q":"入退室管理は物理的セキュリティの一つである。","a":"A","e":"ICカード・生体認証など。"},
  {"g":"物理セキュリティ","q":"サーバ室の温度管理は情報セキュリティとは無関係である。","a":"B","e":"可用性に深く関連。"},
  {"g":"物理セキュリティ","q":"監視カメラは抑止効果を持つ物理的対策の例である。","a":"A","e":"威嚇・記録目的で利用。"},
  {"g":"物理セキュリティ","q":"防火・耐震設備はBCPの一部となり得る。","a":"A","e":"事業継続に重要。"},
  {"g":"物理セキュリティ","q":"ケーブルや機器の盗難は情報漏えいの原因となり得る。","a":"A","e":"物理的な盗難もリスク。"},

  {"g":"攻撃手法","q":"フィッシングは偽のメールやWebページで情報を盗む攻撃である。","a":"A","e":"代表的な詐欺行為。"},
  {"g":"攻撃手法","q":"スミッシングはSMSを悪用するフィッシングの一種である。","a":"A","e":"スマホ利用者を狙う。"},
  {"g":"攻撃手法","q":"ショルダーハッキングは背後から入力を盗み見る手法である。","a":"A","e":"盗み見攻撃の代表。"},
  {"g":"攻撃手法","q":"キーロガーはキーボード操作を記録するマルウェアである。","a":"A","e":"認証情報が盗まれる。"},
  {"g":"攻撃手法","q":"サプライチェーン攻撃は取引先を経由して攻撃する手法である。","a":"A","e":"大企業を狙うために下流企業を侵害する。"},

  {"g":"攻撃手法","q":"DoS攻撃は大量アクセスによりサービスを妨害する攻撃である。","a":"A","e":"単体や分散型（DDoS）がある。"},
  {"g":"攻撃手法","q":"ブルートフォース攻撃は総当たりでパスワードを突破する手法である。","a":"A","e":"桁数が少ないと突破されやすい。"},
  {"g":"攻撃手法","q":"辞書攻撃は一般的な単語を使ってパスワードを推測する攻撃である。","a":"A","e":"弱いパスワードを狙う。"},
  {"g":"攻撃手法","q":"ゼロデイ攻撃は脆弱性が公開される前に行われる攻撃である。","a":"A","e":"修正パッチがない状態を狙う。"},
  {"g":"攻撃手法","q":"SQLインジェクションはOSの脆弱性を狙う攻撃である。","a":"B","e":"DBへの不正クエリを埋め込む攻撃。"},

  {"g":"クラウド","q":"SaaSはアプリケーションをサービスとして提供する形態である。","a":"A","e":"Google Workspaceなど。"},
  {"g":"クラウド","q":"IaaSはアプリケーションまで事業者が提供する形態である。","a":"B","e":"IaaSは基盤のみ提供、アプリは利用者側。"},
  {"g":"クラウド","q":"クラウドでは責任共有モデルの考え方が重要である。","a":"A","e":"事業者と利用者の責任範囲を区別。"},
  {"g":"クラウド","q":"クラウド利用時のアカウント管理は利用者側の責任となる。","a":"A","e":"多くのSaaSで重要。"},
  {"g":"クラウド","q":"クラウドにバックアップを取る場合は、物理災害リスクを完全にゼロにできる。","a":"B","e":"クラウドでも障害リスクは存在。"},

  {"g":"組織・人","q":"情報セキュリティポリシは組織の基本方針を示した文書である。","a":"A","e":"三層構造（基本方針・対策基準・手順）が基本。"},
  {"g":"組織・人","q":"従業員教育はセキュリティ対策とは無関係である。","a":"B","e":"人的ミス対策で最重要。"},
  {"g":"組織・人","q":"内部不正は外部攻撃よりも深刻な被害を出すことがある。","a":"A","e":"内部者は権限を持つため影響が大きい。"},
  {"g":"組織・人","q":"職務分掌は権限を集中させて効率化するための仕組みである。","a":"B","e":"権限を分散し不正防止を図る。"},
  {"g":"組織・人","q":"セキュリティ意識向上のためには定期的な訓練が有効である。","a":"A","e":"教育・演習で強化される。"},


  {"g":"運用管理","q":"システム障害時に備えてバックアップを複数世代保持することは有効である。","a":"A","e":"ランサムウェア感染時も安全な復旧が可能。"},
  {"g":"運用管理","q":"増分バックアップは前回のフルバックアップ以降に変化した分だけを保存する方式である。","a":"A","e":"容量削減に向く。"},
  {"g":"運用管理","q":"差分バックアップは、前回の差分バックアップからの変更分を保存する。","a":"B","e":"“前回フルバックアップから”の差分を保存。"},
  {"g":"運用管理","q":"ホットスタンバイは、待機系が常に稼働状態にある冗長構成である。","a":"A","e":"即時切替可能。"},
  {"g":"運用管理","q":"コールドスタンバイは、待機系が稼働しておらず切替に時間がかかる。","a":"A","e":"コストは低いが復旧が遅い。"},

  {"g":"運用管理","q":"RAID0はデータを分散保存するため障害耐性が高い。","a":"B","e":"RAID0は耐障害性がなく速度向上のみ。"},
  {"g":"運用管理","q":"RAID1はミラーリングで冗長性を確保する。","a":"A","e":"同じデータを複製して保存。"},
  {"g":"運用管理","q":"RAID5はパリティを利用して冗長性を確保する。","a":"A","e":"最低3台で構成。"},
  {"g":"運用管理","q":"BCPは平常時の運用効率を高めるための手法である。","a":"B","e":"事業継続のための備え。"},
  {"g":"運用管理","q":"RTOは復旧目標時間を意味する。","a":"A","e":"復旧に許される最大時間。"},

  {"g":"運用管理","q":"RPOはデータ復旧時点の目標値である。","a":"A","e":"どの時点までデータを戻すかの基準。"},
  {"g":"運用管理","q":"ジョブ管理ではスケジューラが複数処理の実行順序を管理する。","a":"A","e":"バッチ処理で重要。"},
  {"g":"運用管理","q":"負荷分散は可用性や処理効率の向上に役立つ。","a":"A","e":"ロードバランサなど。"},
  {"g":"運用管理","q":"クラスタリングは複数サーバを束ねて一台として使う技術である。","a":"A","e":"冗長化や性能向上に利用。"},
  {"g":"運用管理","q":"障害発生時はすぐにシステムを再起動することが推奨される。","a":"B","e":"原因調査や証拠保全が優先される場合がある。"},

  {"g":"セキュリティ対策","q":"データの暗号化は機密性を高めるために有効である。","a":"A","e":"情報漏えい時の被害を軽減。"},
  {"g":"セキュリティ対策","q":"二要素認証はアカウント乗っ取り対策として有効である。","a":"A","e":"ID/パスワード単独より強い。"},
  {"g":"セキュリティ対策","q":"メールの添付ファイルは自動的に安全である。","a":"B","e":"添付ファイル経由の攻撃が多い。"},
  {"g":"セキュリティ対策","q":"パスワードの使い回しはセキュリティリスクを高める。","a":"A","e":"一つ漏れると全て突破される。"},
  {"g":"セキュリティ対策","q":"VPNは社外から安全に社内ネットワークへアクセスする技術である。","a":"A","e":"通信を暗号化する。"},

  {"g":"セキュリティ対策","q":"ウイルス対策ソフトを導入すればすべての攻撃を防げる。","a":"B","e":"ゼロデイ攻撃などは防げない。"},
  {"g":"セキュリティ対策","q":"パッチ適用は脆弱性対策として最優先で行うべきである。","a":"A","e":"攻撃者は公開後すぐ悪用する。"},
  {"g":"セキュリティ対策","q":"スパムメールは迷惑だがセキュリティと関係はない。","a":"B","e":"フィッシングやマルウェア拡散の手段。"},
  {"g":"セキュリティ対策","q":"USBメモリの使用制限は情報漏えい対策の一つである。","a":"A","e":"外部持ち出しリスクを減らす。"},
  {"g":"セキュリティ対策","q":"クラウドサービスのアクセス制御は利用者側の管理が必要。","a":"A","e":"IAMの設定ミスが事故原因になる。"},

  {"g":"暗号","q":"AESは代表的な共通鍵暗号方式である。","a":"A","e":"高速で広く利用される。"},
  {"g":"暗号","q":"RSAは共通鍵暗号方式の一種である。","a":"B","e":"RSAは公開鍵暗号方式。"},
  {"g":"暗号","q":"ハッシュ関数はデータの改ざん検出に用いられる。","a":"A","e":"整合性確認に利用される。"},
  {"g":"暗号","q":"MD5やSHA-1は現在でも安全性が高いため推奨される。","a":"B","e":"衝突が発見されているため非推奨。"},
  {"g":"暗号","q":"電子証明書には公開鍵が含まれている。","a":"A","e":"認証局が署名し信頼性を保証。"},

  {"g":"暗号","q":"電子署名は送信者が否認できないようにする機能を持つ。","a":"A","e":"否認防止に使われる。"},
  {"g":"暗号","q":"ディジタル署名はデータの完全性検証には使えない。","a":"B","e":"改ざん検出にも使われる。"},
  {"g":"暗号","q":"HTTPSはTLSを利用して暗号化通信を行う。","a":"A","e":"HTTP over TLS。"},
  {"g":"暗号","q":"公開鍵基盤（PKI）は電子証明書の管理の仕組みである。","a":"A","e":"CA・CRLなどを含む。"},
  {"g":"暗号","q":"暗号化とハッシュ化は同じ目的で使用する。","a":"B","e":"暗号化は秘匿、ハッシュ化は完全性確認。"},

  {"g":"ネットワーク","q":"ARPはIPアドレスからMACアドレスを取得する仕組みである。","a":"A","e":"ローカルネットワークで利用。"},
  {"g":"ネットワーク","q":"DHCPはIPアドレスを自動配布する。","a":"A","e":"ネットワーク管理の自動化に有効。"},
  {"g":"ネットワーク","q":"NATは内部IPアドレスを外部と変換して通信する技術である。","a":"A","e":"プライベートアドレスを隠蔽。"},
  {"g":"ネットワーク","q":"DNSはドメイン名とIPアドレスを相互に変換する仕組みである。","a":"A","e":"インターネットの基本。"},
  {"g":"ネットワーク","q":"WPA2は無線LAN暗号化方式の一つである。","a":"A","e":"現在はWPA3が推奨される。"},

  {"g":"ネットワーク","q":"MACアドレスはインターネット上で自由に変更できる。","a":"B","e":"基本的に固定。ただし偽装は可能。"},
  {"g":"ネットワーク","q":"Pingはネットワーク疎通を確認するためのコマンド。","a":"A","e":"ICMP Echo を使用。"},
  {"g":"ネットワーク","q":"SSL-VPNはブラウザで利用できるVPN方式の一つである。","a":"A","e":"設定負荷が小さい。"},
  {"g":"ネットワーク","q":"ゼロトラストは“社内は安全”という前提に基づく考え方である。","a":"B","e":"内部も外部も信用しないモデル。"},
  {"g":"ネットワーク","q":"セキュアブートは起動時に改ざんされていないか確認する仕組み。","a":"A","e":"BIOS/UEFIが検証。"},

  {"g":"データ保護","q":"個人情報は特定の個人を識別できるすべての情報を指す。","a":"A","e":"氏名・住所・顔画像など。"},
  {"g":"データ保護","q":"匿名加工情報は個人を特定できないように加工した情報である。","a":"A","e":"再識別できない加工が必要。"},
  {"g":"データ保護","q":"要配慮個人情報には病歴や障害などが含まれる。","a":"A","e":"本人同意が原則必要。"},
  {"g":"データ保護","q":"仮名加工情報は個人情報に該当しない。","a":"B","e":"個人情報として扱われる（要件緩和のみ）。"},
  {"g":"データ保護","q":"プライバシーマーク制度は個人情報の適切な管理体制を認証する制度である。","a":"A","e":"JIPDECが運営。"},


  {"g":"インシデント管理","q":"インシデント対応では、被害を拡大させないことが最優先となる。","a":"A","e":"初動対応は“封じ込め”が最重要。"},
  {"g":"インシデント管理","q":"インシデントはすべて外部の攻撃によって発生する。","a":"B","e":"誤操作や故障でも発生する。"},
  {"g":"インシデント管理","q":"インシデント報告は上司や担当部署に速やかに行う必要がある。","a":"A","e":"対応遅れが被害拡大につながる。"},
  {"g":"インシデント管理","q":"フォレンジック調査では、証拠としてログを改変しやすいフォーマットへ変換する。","a":"B","e":"証拠改ざんは厳禁。原本保全が原則。"},
  {"g":"インシデント管理","q":"CSIRTはインシデント発生時の調整・分析・対応を担う組織である。","a":"A","e":"組織的な対応体制を確立。"},

  {"g":"インシデント管理","q":"SOCはシステム開発を担当する部署の名称である。","a":"B","e":"SOCは監視センター。"},
  {"g":"インシデント管理","q":"CSIRTはインシデント発生後にしか活動できない。","a":"B","e":"平常時の準備・訓練も重要な活動。"},
  {"g":"インシデント管理","q":"不正アクセスが疑われる場合、まず利用者に事情聴取を行うのが最優先である。","a":"B","e":"まずはシステム隔離など“封じ込め”が先。"},
  {"g":"インシデント管理","q":"ランサムウェア感染時、安易に身代金を支払うことは推奨されない。","a":"A","e":"復号できる保証がない。犯罪助長にもなる。"},
  {"g":"インシデント管理","q":"攻撃を受けたサーバを再起動すると証拠が消える可能性がある。","a":"A","e":"証拠保全が優先。"},

  {"g":"システム管理","q":"システム監査は第三者的立場で行われるべきである。","a":"A","e":"客観性が必要。"},
  {"g":"システム管理","q":"監査証拠は監査人の主観的な感覚だけでもよい。","a":"B","e":"客観的証拠（ログ・文書）が必要。"},
  {"g":"システム管理","q":"変更管理では、変更内容を記録しておく必要がある。","a":"A","e":"変更履歴はトラブル防止に重要。"},
  {"g":"システム管理","q":"構成管理ではハードウェアやソフトウェアの構成情報を管理する。","a":"A","e":"CI（構成項目）管理を行う。"},
  {"g":"システム管理","q":"システムテストでは、セキュリティ機能の確認も含まれる。","a":"A","e":"要件を満たしているか確認。"},

  {"g":"システム管理","q":"ITサービスマネジメントでは、利用者満足度は重視されない。","a":"B","e":"サービス価値の中心は利用者満足。"},
  {"g":"システム管理","q":"SLAはサービスの品質や範囲を契約として明文化したものである。","a":"A","e":"稼働率・応答時間などを定義。"},
  {"g":"システム管理","q":"インシデント管理ではサービス停止の原因究明を最優先に行う。","a":"B","e":"原因究明よりサービス復旧が優先。"},
  {"g":"システム管理","q":"問題管理は根本原因を取り除くことが目的である。","a":"A","e":"再発防止が主目的。"},
  {"g":"システム管理","q":"サービスデスクは利用者とIT部門をつなぐ窓口である。","a":"A","e":"問い合わせ対応などを行う。"},

  {"g":"人的セキュリティ","q":"退職者のアカウントは退職後も一定期間有効にするのが望ましい。","a":"B","e":"即時無効化が原則。"},
  {"g":"人的セキュリティ","q":"内部不正は企業にとって重大な脅威である。","a":"A","e":"権限を持つため被害が大きい。"},
  {"g":"人的セキュリティ","q":"従業員のセキュリティ教育は一度実施すれば十分である。","a":"B","e":"定期的な教育が必要。"},
  {"g":"人的セキュリティ","q":"肩越しに画面をのぞき見される攻撃をショルダーハッキングという。","a":"A","e":"物理的な人的攻撃の例。"},
  {"g":"人的セキュリティ","q":"パスワードの書き置きをモニタに貼ることは一般的なセキュリティ対策である。","a":"B","e":"重大なセキュリティリスク。"},

  {"g":"クラウド","q":"クラウドサービス利用時、認証情報の管理は利用者側が行う必要がある。","a":"A","e":"大半のクラウドでアカウント管理は利用者責任。"},
  {"g":"クラウド","q":"責任共有モデルでは、利用者側にも責任範囲が存在する。","a":"A","e":"IaaS?SaaSで責任範囲が変わる。"},
  {"g":"クラウド","q":"クラウド利用時の設定ミスはセキュリティ事故の原因になり得る。","a":"A","e":"公開設定ミスがよく発生。"},
  {"g":"クラウド","q":"クラウド上のデータは事業者が自動的に完全保護するため、利用者による対策は不要。","a":"B","e":"バックアップ・アクセス制御など利用者も必要。"},
  {"g":"クラウド","q":"クラウドに保存したデータも漏えいする可能性がある。","a":"A","e":"安全性は高いが絶対ではない。"},

  {"g":"最新トレンド","q":"ゼロトラストは“すべてを常に検証する”という考え方である。","a":"A","e":"信頼前提を置かない。"},
  {"g":"最新トレンド","q":"AIを用いた攻撃は従来より自動化され高度になることがある。","a":"A","e":"攻撃効率が上がると懸念。"},
  {"g":"最新トレンド","q":"MFA（多要素認証）は現代では必須のセキュリティ対策となっている。","a":"A","e":"クラウド利用拡大で重要性が増大。"},
  {"g":"最新トレンド","q":"ランサムウェアは現在ほとんど使われていない攻撃手法である。","a":"B","e":"現在も最も多い攻撃の一つ。"},
  {"g":"最新トレンド","q":"サプライチェーン攻撃は取引先を経由して標的へ侵入する手法である。","a":"A","e":"国内でも大規模被害が増加。"},

  {"g":"最新トレンド","q":"クラウド時代ではID管理が非常に重要になる。","a":"A","e":"IDが新たな境界。"},
  {"g":"最新トレンド","q":"脆弱性はOSだけに存在し、アプリケーションには存在しない。","a":"B","e":"アプリケーションにも多数存在。"},
  {"g":"最新トレンド","q":"EDRは端末上の挙動を監視して不審な動きを検知する。","a":"A","e":"ランサムウェア対策として重要。"},
  {"g":"最新トレンド","q":"SIEMは各種ログを統合し相関分析するシステムである。","a":"A","e":"SOCで使用。"},
  {"g":"最新トレンド","q":"MITRE ATT&CKは攻撃手法を体系化した知識ベースである。","a":"A","e":"分析や対策に利用される。"},

  {"g":"最新トレンド","q":"パッチ未適用の放置は重大なセキュリティリスクである。","a":"A","e":"攻撃者は公開後すぐ悪用する。"},
  {"g":"最新トレンド","q":"脆弱性スキャンは脆弱性を実際に攻撃して確認する手法である。","a":"B","e":"攻撃せず安全に診断する。"},
  {"g":"最新トレンド","q":"ペネトレーションテストは攻撃者視点で侵入可能性を確認する試験である。","a":"A","e":"実際に攻撃を試す。"},
  {"g":"最新トレンド","q":"脅威インテリジェンスは攻撃者の情報や手法を分析する活動である。","a":"A","e":"予防的防御に役立つ。"},
  {"g":"最新トレンド","q":"最近の攻撃はメールだけで行われ、USBメモリ経由の攻撃は存在しない。","a":"B","e":"USB経由の攻撃は現在も存在。"},

  {"g":"総合","q":"利用者教育は技術的対策と同じくらい重要である。","a":"A","e":"人的ミスが最も多い原因。"},
  {"g":"総合","q":"情報資産はデータだけであり、設備や人員は含まれない。","a":"B","e":"設備・人・サービスも資産。"},
  {"g":"総合","q":"定期的なログ監視は不正検知に有効である。","a":"A","e":"異常の早期発見につながる。"},
  {"g":"総合","q":"予防策があれば検知と復旧は不要である。","a":"B","e":"多層防御では全フェーズが必要。"},
  {"g":"総合","q":"情報セキュリティは組織全体で取り組むべき活動である。","a":"A","e":"経営層から現場まで一体で動く必要がある。"}
]